[
    {
        "content": "Onculitis Combination Therapy Advisory Board\n\nGrand Hyatt Hotel, Boston, MA\n\nFriday, March 10, 2025\n\nPost-Meeting Report\n\nTable of Contents\n\nI. Participants ........................................................................................ 2\n\nII. Agenda .............................................................................................. 3\n\nIII. Objectives ........................................................................................ 4\n\nIV. Top-line Summary ............................................................................ 5\n\nOnculitis MoA and Clinical Implications Efficacy and Safety of Onculitis PFS-R: Concepts and Relationship to Onculitis Additional Data and Educational Recommendations\n\nV. Onculitis MoA and Clinical Implications ............................................ 8\n\nMoA -- General Feedback Resistance Mechanisms Additional Studies and Educational Needs\n\nVI. Onculitis Efficacy in Treatment-Naïve Melanocarcinoma Patients .. 10\n\nImaging Response Assessment Biomarker Analysis\n\nVII. Onculitis Efficacy in Relapsed Melanocarcinoma .......................... 11\n\nOnculitis Usage-Observations by Advisors Imaging Response Assessment Efficacy -- General Feedback Safety\n\nVIII. Onculitis Extension Data and Post Hoc Analyses ........................ 14\n\nLong-term Extension Post Hoc Analyses\n\nIX. PFS-R: Concepts and Relationship to Onculitis ............................. 15",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 0,
            "chunk_length": 1428,
            "num_words": 134
        }
    },
    {
        "content": "X. Workshop: PFS-R in Clinical Practice ............................................. 17\n\nCase Scenario 1 Clinical Considerations Case Scenario 2 Clinical Considerations\n\nXI. Follow-up and Recommendations .................................................. 20\n\nI. Participants\n\nChair\n\nEleanor Chen, MD, PhD [EC] Dana-Farber Cancer Institute Boston, MA\n\nAdvisors\n\nMichael Sanderson, MD [MS] Memorial Sloan Kettering New York, NY Vivian Park, MD [VP] MD Anderson Cancer Center Houston, TX James Rodriguez, MD [JR] Northwestern University Chicago, IL Sophia Williams, MD [SW] UCLA Medical Center Los Angeles, CA David Thompson, MD [DT] Mayo Clinic Rochester, MN Rachel Goldman, MD [RG] Johns Hopkins Baltimore, MD Amir Patel, MD, PhD [AP] Stanford Cancer Center Palo Alto, CA Olivia Chen, MD, PhD [OC] UCSF Helen Diller Family Comprehensive Cancer Center San Francisco, CA Benjamin Kim, MD [BK] City of Hope Duarte, CA Sarah Montgomery, MD [SM] Fred Hutchinson Cancer Center Seattle, WA Thomas Wright, MD, PhD [TW] University of Pennsylvania Philadelphia, PA\n\nNovaris\n\nJennifer Lee [JL] Associate Director, Oncology Training Cambridge, MA Robert Martinez, MD [RM] Director of Medical Affairs Cambridge, MA\n\nCaroline Singh, MD, PhD [CS] Medical Director Cambridge, MA Mark Davidson [MD] Senior Manager Cambridge, MA Lisa Johnson, PhD [LJ] Medical Science Liaison Cambridge, MA\n\nBioMed Consulting Group",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 1,
            "chunk_length": 1396,
            "num_words": 195
        }
    },
    {
        "content": "Daniel Wilson BioMed Consulting Group Boston, MA Katherine Reed, PhD BioMed Consulting Group San Francisco, CA Priya Sharma, PhD BioMed Consulting Group Chicago, IL\n\nII. Agenda\n\nFriday, March 10\n\n7:00 AM - Breakfast\n\n7:45 AM - Welcome, Introductions and Meeting Objectives Chairperson: Eleanor Chen, MD, PhD\n\n8:00 AM - Onculitis MoA and Clinical Implications (20-min presentation/30-min discussion) Presenter: David Thompson, MD\n\n8:50 AM - Onculitis Efficacy in Treatment-Naïve Melanocarcinoma Patients (MELA-ONE) (20-min presentation/35-min discussion) Presenter: Benjamin Kim, MD\n\n9:45 AM - Break (15 min)\n\n10:00 AM - Onculitis Efficacy in Patients With Relapsed Melanocarcinoma (Phase 2, MELA-TWO, and COMBO-1) (30-min presentation/45-min discussion) Presenter: Eleanor Chen, MD, PhD\n\n11:15 AM - Onculitis Extension Data and Post Hoc Analyses (25-min presentation/35-min discussion) Presenter: Sophia Williams, MD\n\n12:15 PM - Lunch (ongoing discussion)\n\n1:00 PM - PFS-R: Concepts and Relationship to Onculitis (20-min presentation/40-min discussion) Moderator: Vivian Park, MD\n\n2:00 PM - Workshop: PFS-R in Clinical Practice (2 breakouts) (60-min discussion) Moderator: Robert Martinez, MD, and Caroline Singh, MD, PhD\n\n3:00 PM - Break (15 min)\n\n3:15 PM - Workshop Recap (30 min)\n\n3:45 PM - Final Comments, Sponsor and Chair Summaries\n\n4:00 PM - Adjourn\n\nIII. Objectives",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 2,
            "chunk_length": 1373,
            "num_words": 195
        }
    },
    {
        "content": "Obtain expert feedback on: Onculitis efficacy in patients with Melanocarcinoma Mechanism of action (MoA) and clinical implications Real-world applicability of progression-free survival with response (PFS-R) as a treatment goal in Melanocarcinoma PFS-R results of Onculitis combination therapies, and implications for Onculitis's place in the current treatment paradigm\n\nIV. Top-line Summary\n\nOnculitis MoA and Clinical Implications It is important to highlight that Onculitis selectively targets the MCR3 receptor on tumor cells while sparing normal tissue, unlike some other immunotherapies. This is crucial and central to treatment decisions and sequencing. The MoA needs to be communicated in a simple and effective way instead of presenting a complicated message around tumor microenvironment modulation that does not resonate with patients. Key talking points for Onculitis MoA include the following: Selectively targets tumor cells with minimal impact on healthy tissue Enhances immune recognition and response to tumor cells Shows synergistic effects when combined with immune checkpoint inhibitors\n\nThe MoA needs to be further elucidated to better identify the most appropriate patient for Onculitis treatment.\n\nPatients with high MCR3 expression may be optimal candidates for Onculitis combination therapy. Understanding the mechanistic basis of resistance will enhance the comfort level of using this drug in combination therapies.",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 3,
            "chunk_length": 1441,
            "num_words": 200
        }
    },
    {
        "content": "Efficacy and Safety of Onculitis: Phase 2, MELA-ONE, MELA-TWO, and COMBO-1 Based on patients included in the Onculitis trials, Onculitis may be suitable for patients with aggressive disease; this message must be communicated to clinicians and patients. Imaging and the biomarker analysis data from clinical trials confirm that Onculitis is more efficacious in patients with higher MCR3 expression and more advanced disease activity. Patients switched from standard immunotherapy to Onculitis have remained stable, adding to the body of evidence that Onculitis is indeed effective in patients with advanced disease. Lack of information on effect of Onculitis in different ethnic groups (African Americans vs Caucasians) was criticized.\n\nThe MELA-ONE data are reassuring and enhance comfort level for use of Onculitis in treatment- naïve Melanocarcinoma patients. Advisors concurred that Onculitis has very strong long-term data (more than 5 years), unlike any other targeted therapy for Melanocarcinoma; it is encouraging to know that patients did well for more than 5 years. Tumor response rate rather than tumor volume should be an endpoint, as it correlates with survival and quality of life. Number needed to treat (NNT) data show that Onculitis combination therapies offer significant advantages over monotherapy. Hence, it is important to communicate differences in MoA and synergistic effects. Onculitis NNT data for different patient subgroups need to be presented.",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 4,
            "chunk_length": 1472,
            "num_words": 217
        }
    },
    {
        "content": "Advisors agreed that the once-weekly dosing of Onculitis was an advantage over the more frequent dosing schedules of other therapies. Overall, Onculitis is well tolerated. There have been a few cases of severe skin reactions and infusion-related reactions leading to treatment discontinuation.\n\nPFS-R: Concepts and Relationship to Onculitis PFS-R was considered by most to be a relevant outcome measure. Limitations include the lack of quality of life assessment, making PFS-R less useful in patients with significant comorbidities.\n\nFor these patients, progression-free survival with tolerability may be a more realistic treatment goal.\n\nAnother drawback is the lack of concrete evidence in support of the prognostic ability of PFS- R 3-5 years after a treatment is initiated.\n\nOverall survival is a desirable component of PFS-R, although it is confounded by subsequent therapies and crossover in clinical trials. Although the concept of PFS-R has always been integrated into clinical practice, there is ambiguity surrounding its implementation.\n\nAdditional Data and Educational Recommendations Specific mechanisms that detail the synergistic effects with other therapies must be investigated. The magnitude of the effect of Onculitis on immune cell infiltration and the dose required to achieve optimal response need to be assessed. The time frame of when resistance develops after the initiation of therapy needs to be investigated.",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 5,
            "chunk_length": 1435,
            "num_words": 210
        }
    },
    {
        "content": "Imaging response in patients who discontinued the trial should be pursued; this evaluation will provide insight into disease activity in the absence of continuous treatment. Real-world patient outcomes including effect of treatment on quality of life, functional status, and symptom burden need to be captured. Patient communication should include presentations on management of skin reactions and strategies to mitigate infusion-related reactions.\n\nV. Onculitis MoA and Clinical Implications\n\nMoA -- General Feedback Onculitis selectively targets the MCR3 receptor on tumor cells while sparing normal tissue—this message is central to the MoA and must be emphasized and effectively communicated. This sets the drug apart from other immunotherapies (eg, anti-CTLA-4, anti-PD-1), which can have significant immune-related adverse events, and plays an important role in treatment decisions and sequencing [DT, RG]. Onculitis enhances immune recognition of tumor cells, and thus increases tumor-infiltrating lymphocytes and immune-mediated tumor cell killing [DT].\n\nThere was an overwhelming request for further advancing Onculitis MoA research. It is imperative to understand whether some of the immune tolerance mechanisms are overcome with Onculitis treatment; therefore, investing in such studies is of immense value",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 6,
            "chunk_length": 1317,
            "num_words": 182
        }
    },
    {
        "content": "[DT]. MoA needs to be studied in more detail with regards to mechanistic rationale for patient selection, treatment sequencing, and observation of certain adverse effects with Onculitis [general consensus]. Further elucidation of mechanisms will help carve out a distinct patient population that is most suitable for Onculitis [VP].\n\nAdvisor queries centered around the following points regarding the MoA of Onculitis: The clinical dose equivalent of 5 mg/kg of Onculitis in mouse models [BK]. The magnitude of the effect of Onculitis on tumor microenvironment; the proportion of cytotoxic versus regulatory T cells being affected [BK, TW]. Novaris Medical noted that there was a mean increase in CD8+ T cells by 120% in the pooled trial data though the peripheral blood lymphocyte levels remained within the normal range. Data from single-cell RNA sequencing analyses in the ONCUDYNAMIC study, regarding the changes in immune cell populations, will be presented at ASCO 2025.\n\nThe remaining quantity of MCR3 receptor following Onculitis administration [TW]. Similar targeted therapies modify the tumor microenvironment by 30%. Similar information is required for Onculitis, since MoA is a key communication point to patients [MS]. Novaris Medical clarified that the experience with MCR3 inhibitors extends over the past 7 years, and a lot of mechanistic information about this drug class has been uncovered.",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 7,
            "chunk_length": 1408,
            "num_words": 212
        }
    },
    {
        "content": "One advisor pointed out that extrapolation of findings from other MCR3 inhibitors to Onculitis is insufficient in delineating the precise MoA of Onculitis [MS]. One advisor voiced skepticism around the need for a detailed MoA investigation since most drugs are prescribed based on clinician and patient perception rather than mechanistic actions [SW].\n\nResistance Mechanisms Important to identify the MoA regarding the development of resistance. One advisor noted the availability of a poster showing changes in MCR3 expression before and after the development of progressive disease [MS]. Knowledge about the resistance mechanisms with Onculitis will increase comfort level [MS]. Although outcomes with standard immunotherapies are variable, physicians continue to prescribe these medications to patients with aggressive disease due to their comfort with the known resistance patterns [SM]. As of this date, the Onculitis registries have not demonstrated any unexpected resistance patterns, but it is imperative that physicians monitor for early signs of progression [DT].\n\nThere was a request to conduct resistance studies in patient-derived xenograft models [SW].\n\nAdditional Studies and Educational Needs The MoA of Onculitis must be communicated in a simple and effective way [general consensus]. The tumor microenvironment modulation story is complicated to communicate to patients. There are other drugs with simpler MoA explanations.",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 8,
            "chunk_length": 1441,
            "num_words": 205
        }
    },
    {
        "content": "Key takeaway is the selective targeting, and not broad immunosuppression, of tumor cells [DT]. Effect of Onculitis on both innate and adaptive immune responses needs to be emphasized. Clearly differentiate between mechanisms of immune activation and direct cytotoxicity for patients [RG].\n\nThe following need to be studied: Reversibility of resistance (mechanisms and factors) and the associated time frame of response restoration upon addition of combination therapies [OC, SM]. Effect of Onculitis on quality of life and symptom burden [MS].\n\nVI. Onculitis Efficacy in Treatment-Naïve Melanocarcinoma Patients (MELA- ONE)\n\nTypically, advisors treat patients early in the course of the disease [general consensus]. However, nowadays clinicians see fewer patients with treatment-naïve disease [EC].\n\nImaging Response Assessment For the data showing the risk of progression or imaging response, the 12-week time point should be considered as a baseline [MS, TW]. A true separation between the active therapy groups and the control group is seen at 24 weeks [TW]. The high numbers are primarily driven by new lesions rather than growth of existing lesions confirming the presence of significant disease activity in MELA-ONE patients [TW]. Suppression of disease activity with Onculitis is lower than expected, as much stronger imaging effects were observed with Onculitis in MELA-TWO [TW].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 9,
            "chunk_length": 1387,
            "num_words": 203
        }
    },
    {
        "content": "Advisors debated whether standard immunotherapies and targeted therapies have stronger effects on imaging response than Onculitis based on the MELA-ONE results. One advisor stated that the greater effects on imaging response was observed with standard immunotherapies and targeted therapies in their respective clinical studies [SM], whereas another advisor [TW] pointed out that these drugs have not been studied in the same patient\n\npopulation and also that targeted therapies failed to significantly improve overall survival in the CONFIRM-2 study. Superior effects on imaging response have been observed with combination immunotherapy in the CHECKMATE-067 study and with BRAF/MEK inhibition in the COMBI-v study [TW].\n\nChange in tumor volume is not a sensitive outcome measure [EC]. A lesion can shrink in size and a new lesion can develop over time; both these changes can impact tumor volume data [EC]. Rather than tumor volume, the response rate is a more reliable outcome [EC]. Response rates correlate with survival and quality of life over 2 years, whereas no such correlation has been seen with tumor volume [TW; unpublished observations from an ongoing study].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 10,
            "chunk_length": 1172,
            "num_words": 178
        }
    },
    {
        "content": "Biomarker Analysis The biomarker analyses results in MELA-ONE are very informative and align with similar data reported for MELA-TWO and COMBO-1. Support that Onculitis is well suited for Melanocarcinoma patients with high MCR3 expression [TW]. A limitation of these analyses is the lack of information on ethnic subgroups [OC]. With the majority of patients being Caucasian, differential effects of Onculitis on African Americans versus the Caucasian patient population cannot be elucidated based on the available analyses.\n\nVII. Onculitis Efficacy in Patients With Relapsed Melanocarcinoma (Phase 2, MELA-TWO, and COMBO-1)\n\nOnculitis Usage-Observations by Advisors Older patients (>65 years of age) who are not suitable for combination immunotherapy may be an ideal patient group for Onculitis treatment [BK]. Onculitis should be considered for patients with a more aggressive form of Melanocarcinoma [VP]. One advisor noted positive experience of switching a patient from standard immunotherapy to Onculitis [MS].\n\nOnculitis is more appropriate for newly diagnosed patients; it may not be considered for patients with multiply relapsed disease [TW]. Careful consideration must be given for prescribing Onculitis for pregnant patients [SW]. The Pregnancy Category C is a factor in considering Onculitis for pregnant patients [VP].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 11,
            "chunk_length": 1332,
            "num_words": 191
        }
    },
    {
        "content": "Unlike standard immunotherapies and targeted therapies, Onculitis does not get eliminated from the system within a short period of time by itself [SM]. Onculitis may be more suitable for the young female patient who is in her early 20s and is not planning a family in the near future [SW]. However, one advisor strongly opined that a young woman of childbearing potential must not be excluded from being treated with Onculitis [MS]. Although the waiting period before attempting pregnancy may not be convenient for some patients, it is important to emphasize the option of delaying pregnancy, if necessary [SM]. One patient from the Onculitis registry delivered a healthy baby after completing the recommended waiting period [MS].\n\nA monitoring program, similar to that of HUMIRA, was suggested for Onculitis [SM].\n\nSeveral advisors discussed the potential combination strategies with Onculitis [AP, OC, RG]. Combining Onculitis with anti-PD-1 therapy showed promising results in the COMBO-1 trial, with a 22% increase in objective response rate compared to anti-PD-1 monotherapy [AP]. Sequential therapy with Onculitis following progression on BRAF/MEK inhibitors may be an effective strategy for BRAF-mutant patients [OC]. The synergistic effect observed when combining Onculitis with chemotherapy in preclinical models warrants further investigation in clinical trials [RG].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 12,
            "chunk_length": 1377,
            "num_words": 203
        }
    },
    {
        "content": "Imaging Response Assessment Imaging results of phase 2 study substantiate that Onculitis treatment reduces tumor size within 6 weeks [EC]. The MELA-TWO data show that the imaging findings are more encouraging than those of MELA- ONE; this difference can be attributed to the patient population with more advanced disease in MELA-TWO [TW]. Advisors discussed early change in tumor burden being a prognostic indicator of long-term survival. The 0- to 6-month change in tumor burden always needs to be collected, as this is one of the best predictors of survival in 5 years. Calling this pseudoprogression is not correct. The 6- to 24-month change collection, which is becoming routine practice, is not going to hold out [TW]. Consistent evidence that the change in tumor burden from 0 to 6 months predicts survival needs to be seen. Significant change in 6 months in some patients represents a very aggressive disease process that may be resistant to any treatment [EC].\n\nAt the annual meeting of ASCO 2025, Dr. Smith presented combination therapy data in which, although percentage reduction was significantly high, the absolute survival benefit was small (0.3 years). It was noted that the imaging data (response patterns) of both MELA-TWO and MELA-ONE are being reanalyzed [TW].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 13,
            "chunk_length": 1279,
            "num_words": 204
        }
    },
    {
        "content": "Recently published data in relapsed Melanocarcinoma patients showed that change in tumor- infiltrating lymphocytes in the first 6 months was the best predictor of survival over a 2-year time period [TW]. It was queried whether the changes in the tumor are a surrogate for other degenerative mechanisms occurring in the body as a result of aging [EC]. Use of circulating tumor DNA as a biomarker for treatment response was discussed.\n\nEfficacy -- General Feedback Post-marketing experience with Onculitis has surpassed efficacy expectations based on clinical trial results (response rate ~40%) [BK]. Novaris Medical wanted to know from the advisors their opinions regarding that although Onculitis has strong survival data, there is a general perception of the drug being less efficacious than other targeted agents in the market based on its response data. RECIST criteria lacks functional components and has poor sensitivity; immune-related response criteria should be presented along with RECIST to build more confidence in the response data [BK, VP]. The fact that Onculitis is the only targeted therapy for Melanocarcinoma that has consistent survival data in 2 separate studies is a very powerful message [VP].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 14,
            "chunk_length": 1215,
            "num_words": 186
        }
    },
    {
        "content": "One advisor remarked that Novaris should not have terminated the phase 3 combination study (COMBO-2) [TW]. The phase 2 combination data looked encouraging, and although reimbursement for a combination therapy may have been difficult, the results of the completed study would have attracted a lot of patients.\n\nSafety As more information and data become available from the long-term use of Onculitis, clinicians become more aware of the associated adverse events [DT]. Most advisors agreed that Onculitis is well tolerated by patients. Skin reactions and infusion-related reactions were noted as the 2 primary reasons for treatment discontinuation [TW, SW].\n\nSevere skin reactions have been reported in approximately 5% of patients and resulted in treatment discontinuation in 1 patient [TW]. One patient discontinued Onculitis treatment due to a severe infusion-related reaction, but did not experience any other serious adverse event in the past 6 months [SW].\n\nHair thinning has not emerged as a major concern with Onculitis. Severe hair thinning was observed in 1 patient [MS]; however, hair thinning has not led to any treatment discontinuation [VP]. Hair thinning is also experienced with other targeted therapies [MS]. Management strategies for skin reactions should be included in patient communications [DT]. Novaris Medical clarified that the educational materials with skin reaction management guidance will be made available to all health care providers by the MSLs.",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 15,
            "chunk_length": 1477,
            "num_words": 221
        }
    },
    {
        "content": "It was queried whether 2.5 mg/kg is an optimal dose of Onculitis and whether it achieves a complete receptor blockade [RG]. Novaris Medical clarified that the dose selection was based on the preclinical studies. Mechanistic differences in achieving a complete receptor blockade have not been tested between different doses of Onculitis. Although higher doses of Onculitis are being considered, there is a potential for higher safety concerns.\n\nVIII. Onculitis Extension Data and Post Hoc Analyses\n\nLong-term Extension Onculitis has strong long-term extension data. Although the patient numbers are small, it is encouraging to know that patients do well over 5 years [MS]. Phase 2 extension data show that if the drug works for some patients, it works long term [SW]. Long-term (3 years) data are needed for patients who had a low response rate at 1 and 2 years [DT].\n\nLong-term data also aid the clinician in making an informed decision regarding patient selection [VP].\n\nPositive long-term progression-free survival data are expected of Onculitis, as is the case with any other therapy since only the patients who did well and continued to stay on treatment are being followed up [MS]. Novaris should follow-up on patients who dropped out from extension and evaluate imaging response outcomes [SW].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 16,
            "chunk_length": 1299,
            "num_words": 206
        }
    },
    {
        "content": "Unlike other diseases such as breast cancer in which early-stage patients have excellent outcomes, Melanocarcinoma is associated with high recurrence rates; therefore, the long-term efficacy data are extremely important [VP]. There is a need for a large scale long-term follow-up study of patients on various treatments; this should include efficacy and safety data [TW].\n\nThe impact of long-term Onculitis treatment on immune memory and subsequent response to other therapies requires further investigation [JR]. Patients who discontinued Onculitis due to adverse events but had achieved an objective response showed durable responses in some cases, suggesting an immune memory effect [AP]. Understanding the long-term immunological changes induced by Onculitis would help optimize treatment sequencing strategies [OC].\n\nPost Hoc Analyses NNT of 4 or the fact that 4 people have to be treated to avoid 1 progression event is impressive compared to other therapies in this space [SM]. NNT data show significant differences between Onculitis and standard therapies. Therefore, the differences in MoA and clinical outcomes are important in distinguishing each therapy from another [SW]. When presenting NNT data for Onculitis, include similar data for the standard immunotherapies along with other newer therapies [TW]. NNT data for different patient subgroups need to be collected [MS]. Generating NNT data using biomarker-positive patients is helpful [TW].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 17,
            "chunk_length": 1456,
            "num_words": 211
        }
    },
    {
        "content": "Biomarkers for treatment response with Onculitis need to be validated [SW, OC]. The MCR3 expression level showed correlation with response in the MELA-TWO study, but additional predictive biomarkers would enhance patient selection [BK]. Liquid biopsy for circulating tumor DNA may provide early indicators of response or resistance to Onculitis therapy [TW]. Tumor mutational burden and immune cell infiltration patterns could be explored as potential predictors of response to Onculitis combination therapy [AP].\n\nIX. PFS-R: Concepts and Relationship to Onculitis\n\nAchieving both progression-free survival and objective response (PFS-R) is an effective treatment plan [SW]. PFS-R is a valid metric for all therapies and must be discussed with the patient [MS].\n\nPFS-R should be a treatment goal and must be instituted in newly diagnosed patients [RG]. Achieving PFS-R early on should be the treatment goal [BK].\n\nPFS-R as an outcome measure is beneficial, as it forces clinicians to look for both response and durability [VP]. However, safety is a key concern for patients, which is not a factor in PFS-R [VP].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 18,
            "chunk_length": 1111,
            "num_words": 169
        }
    },
    {
        "content": "Although good to practice short-term, evidence in support of PFS-R as a predictive measure is lacking [MS]. There is considerable ambiguity regarding the impact of this metric on treatment decisions and its long-term prognostic value [SW]. However, the MELANOMA-TRACK study and long-term analysis of the CHECKMATE-067 study showed some predictability; the CHECKMATE-067 long-term study showed that those who met PFS-R in the first year had better long-term outcomes.\n\nEvaluation of PFS-R in a 4-year longitudinal Melanocarcinoma cohort showed that the long-term predictive value of PFS-R was moderate. A limitation was the lack of data from newer targeted therapies.\n\nLimitations to PFS-R as a metric: Lack of quality of life, symptom burden, and patient-reported outcome measures in the assessment of PFS-R. \"Progression-free survival with tolerability\" is a more realistic treatment goal. In patients who have significant comorbidities from the onset of treatment, PFS-R may not be as useful since PFS-R does not include a tolerability component in it. Inclusion of overall survival in PFS-R is confounded by subsequent therapies and crossover in clinical trials. For example, a patient with a complete response but significant toxicity may have a considerably lower quality of life than a patient with stable disease but minimal toxicity [TW].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 19,
            "chunk_length": 1346,
            "num_words": 202
        }
    },
    {
        "content": "The probability of PFS-R being a prognostic factor 3-5 years post-treatment [EC]. The effect of age-related comorbidities on PFS-R needs to be evaluated [EC].\n\nThe degree of response varies from patient to patient, thus impacting PFS-R [MS]. PFS-R may not be a realistic long-term goal as more Melanocarcinoma therapies become available, leading to more frequent treatment switches [TW]. Patient may not remain on a specific drug for a prolonged period of time [TW].\n\nIn the CHECKMATE-067 study, a 3-fold improvement was observed with combination immunotherapy versus monotherapy [MS].\n\nHowever, the PFS-R value for the monotherapy group was not 0 and that for the combination group was 35%; this suggests that some patients may achieve PFS-R with less intensive treatment, which may be attributable to the natural course of Melanocarcinoma [VP]. These data show the dissociation between the clinical and real-world observations, as most patients do much better on combination therapy than demonstrated by the CHECKMATE-067 results [SM]. The low difference in the PFS-R values between combination therapy and monotherapy can be attributed to the following [TW]: Lower sensitivity of imaging modalities used in older studies. Variations in analysis techniques.\n\nIt was further clarified that the Year 1-2 data of combination therapy in CHECKMATE-067 are much superior to Year 0-1, as the effect of immunotherapy is not evident until 2-3 months after treatment [VP].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 20,
            "chunk_length": 1464,
            "num_words": 223
        }
    },
    {
        "content": "It was recommended that Novaris do a prospective analysis on real-world patients receiving Onculitis treatment, as this population will be different from those enrolled in the clinical trials [TW]. Expectations from PFS-R vary from drug to drug; there is a need to assess Onculitis's position in the treatment algorithm that will help patients achieve PFS-R [MS].\n\nSeveral advisors emphasized the need for additional endpoints beyond PFS-R to fully capture the benefit of Onculitis combination therapy [AP, JR, OC]. Treatment-free interval following Onculitis therapy could be an important measure of therapeutic benefit, particularly for combinations that achieve deep responses [AP]. Immune-related adverse events during and after treatment should be systematically collected and analyzed as part of efficacy assessments [JR]. Patient-reported outcomes, particularly those related to symptom burden and functional status, should be incorporated into future Onculitis clinical trials [OC].\n\nX. Workshop: PFS-R in Clinical Practice (2 Case Scenarios)\n\nCase Scenario 1 Patient with 1 disease progression but no objective response in the last year who is also experiencing fatigue from multiple prior therapies and would like to switch to Onculitis.\n\nClinical Considerations",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 21,
            "chunk_length": 1272,
            "num_words": 181
        }
    },
    {
        "content": "In general, treatments should be individualized on a case-by-case basis; there are no universal guidelines applicable to all Melanocarcinoma patients [SM]. Patient's disease should be treated as aggressively as possible [EC]. The clinical situation of the patient primarily drives treatment decisions [DT].\n\nPFS-R is a feasible metric in this patient [BK]. The lack of objective response is concerning for poor prognosis, but response may occur if a new treatment is initiated; the patient may benefit from a switch to Onculitis [BK].\n\nPrognostic factors that will impact clinical decisions in this patient include [BK]: Type of progression (new lesions vs growth of existing lesions vs others [visceral/brain metastases]). Patient demographics including age, gender, comorbidities, and race. Length of time since diagnosis of Melanocarcinoma, and treatment duration. Patient preference. Performance status should be maintained above ECOG 2. Level of disease burden: A high tumor burden indicates that the patient needs to be treated aggressively [SM]. However, the difference between low volume and moderate volume disease is not very meaningful and will not impact clinical decisions [MS].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 22,
            "chunk_length": 1191,
            "num_words": 174
        }
    },
    {
        "content": "Treatment switch decisions are determined by the following: Adverse events of a treatment [BK]. Patient's threshold for tolerability [BK]. Previous treatment history and response patterns [AP]. Molecular characteristics of the tumor including MCR3 expression level [OC]. Availability of clinical trials and access to newer therapies [JR].\n\nCase Scenario 2 Patient who is clinically stable on Onculitis who experienced 1 new lesion in the last 6 months. Additional patient characteristics: 45 years of age, female, and been on Onculitis for 2 years.\n\nClinical Considerations\n\nTreatment: Individual patient profile must be strongly considered.\n\nFor example, an African American patient with brain metastases will be treated more aggressively [MS]. It is important for patients to believe in the treatment they are receiving, as it gets harder to switch as time progresses [EC]. Age, insurance, and employment status need to be considered [EC].\n\nOne advisor shared a similar anecdotal experience of a patient (early 40s) on anti-PD-1 therapy who experienced 1 new lesion after 2 years of treatment and preferred to continue treatment rather than switching [SM]. The importance of compliance must be underscored to the patient [EC].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 23,
            "chunk_length": 1228,
            "num_words": 184
        }
    },
    {
        "content": "There are many factors that influence treatment switch decisions: Lesion attributes including size [JR] and location (brain vs liver involvement) [BK]. It is important to note that approximately 40% of new lesions do not lead to symptomatic progression or significantly impact quality of life [MS]. In an ongoing study, the clinical relevance of oligometastatic progression after treatment is being evaluated. Although it is known that these lesions may be amenable to local therapy such as radiation, the development of widespread progression may still occur [TW].\n\nPatient will be switched from one treatment to another if there are tolerance issues and/or he/she develops significant immune-related adverse events [VP]. Patient will be switched to combination therapy if the patient is experiencing isolated progression, has 1 new lesion, and maintained good performance status on Onculitis [VP].\n\nSymptom Burden: A moderate increase in symptoms may not warrant a treatment switch for a patient with advanced disease [RG]. Patient-reported outcomes may provide additional information that is not captured by PFS-R [VP].",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 24,
            "chunk_length": 1122,
            "num_words": 166
        }
    },
    {
        "content": "Diagnosis: Brain MRI is mostly used for surveillance [BK]. Initially, measurable lesions and RECIST criteria are evaluated; more aggressive forms of disease warrant advanced imaging assessments [DT]. In clinical practice, time is a constraint; therefore, conducting comprehensive imaging at every visit is not feasible. Targeted assessments based on symptoms are more impactful since they can guide therapeutic decisions [TW].\n\nAlthough Melanocarcinoma has improved outcomes with newer therapies, it still includes a wide spectrum of prognoses [EC].\n\nChanges in functional status, quality of life, and symptom assessments need to be routinely evaluated [EC].\n\nAdvisors discussed specific combination strategies for this case scenario [AP, OC, JR]: Adding an anti-PD-1 agent to Onculitis could potentially re-establish disease control by targeting complementary immune pathways [AP]. For isolated progression, local therapy with continued Onculitis might be appropriate before switching to a different systemic therapy [OC]. Increasing the dose frequency of Onculitis while maintaining the same dose level could be considered before abandoning a therapy that has provided 2 years of disease control [JR].\n\nXI. Follow-up and Recommendations\n\nOnculitis MoA ADVISOR FEEDBACK:",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 25,
            "chunk_length": 1271,
            "num_words": 176
        }
    },
    {
        "content": "Specific mechanisms that further elucidate the MoA and detail the synergistic effects with other therapies must be investigated The magnitude of the effect of Onculitis on immune cell infiltration Proportion of cytotoxic versus regulatory T cells affected by Onculitis\n\nDose required to achieve optimal response; potential for dose adjustments The time frame of when resistance develops after the initiation of therapy Information clearly differentiating immune activation and direct cytotoxicity mechanisms for patients is required\n\nFOLLOW-UP ACTION:\n\nAll 5 recommendations will be forwarded to the Medical Affairs and Research and Development teams\n\nOnculitis Efficacy ADVISOR FEEDBACK:\n\nImaging response in patients who discontinued the clinical study When presenting NNT data for Onculitis, include similar data for standard therapies along with other newer therapies NNT data for different patient subgroups need to be presented\n\nFOLLOW-UP ACTION:\n\nRecommendations (first 2) will be forwarded to the Medical Affairs and Commercial teams Recommendation (third) will be forwarded to the Medical Affairs and Research and Development teams\n\nCombination Therapy Strategies ADVISOR FEEDBACK:",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 26,
            "chunk_length": 1190,
            "num_words": 165
        }
    },
    {
        "content": "Investigate and prioritize rational combinations based on complementary mechanisms of action Develop biomarker strategies to identify patients most likely to benefit from specific combinations Consider sequential therapy approaches in addition to concurrent combination therapy Establish optimal dosing and scheduling for combinations to minimize toxicity while maximizing efficacy\n\nFOLLOW-UP ACTION:\n\nAll recommendations will be forwarded to the Clinical Development and Medical Affairs teams\n\nAdditional Studies and Educational Needs ADVISOR FEEDBACK:\n\nMechanism of skin reactions needs to be communicated Real-world patient outcomes including effect of treatment on quality of life, functional status, and symptom burden need to be captured\n\nFOLLOW-UP ACTION:\n\nBoth recommendations will be forwarded to the Medical Affairs and Research and Development teams",
        "metadata": {
            "file_name": "Onculitis Combination Therapy Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 451884,
            "chunk_type": "pdf_chunk",
            "chunk_index": 27,
            "chunk_length": 860,
            "num_words": 113
        }
    },
    {
        "content": "Onculitis Biomarker Development and Patient Selection Advisory Board\n\nThe Ritz-Carlton Hotel, Boston, MA\n\nSaturday, March 18, 2025\n\nPost-Meeting Report\n\nTable of Contents\n\nI. Participants\n\nII. Agenda\n\nIII. Objectives\n\nIV. Top-line Summary\n\nOnculitis Mechanism of Action and Clinical Implications Biomarker Development for Patient Selection Efficacy in Various Tumor Types and Patient Populations Real-World Evidence and Treatment Strategies\n\nV. Onculitis Mechanism of Action and Clinical Implications\n\nMoA -- General Feedback Clinical Implications Additional Studies and Educational Needs\n\nVI. Biomarker Development for Patient Selection\n\nCurrent Biomarker Landscape Predictive vs. Prognostic Biomarkers Tumor Microenvironment Considerations\n\nVII. Efficacy in Various Tumor Types and Patient Populations\n\nMelanocarcinoma Data Other Solid Tumors Treatment-Resistant Populations\n\nVIII. Real-World Evidence and Treatment Strategies\n\nCurrent Treatment Algorithms Long-term Safety Data Treatment Sequencing\n\nIX. Workshop: Biomarker Implementation in Clinical Practice\n\nCase Scenario 1 Clinical Considerations Case Scenario 2 Clinical Considerations\n\nX. Follow-up and Recommendations\n\nOnculitis MoA Biomarker Development Efficacy and Real-World Evidence Educational Needs\n\nI. Participants\n\nChair\n\nSarah Blackstone, MD, PhD [SB] Memorial Sloan Kettering Cancer Center New York, NY\n\nAdvisors\n\n|  |\n|---|\n|  |",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 0,
            "chunk_length": 1400,
            "num_words": 174
        }
    },
    {
        "content": "| Name | Institution |\n|---|---|\n| David Chen, MD [DC] | MD Anderson Cancer Center<br>Houston, TX |\n| Elena Rodriguez, MD, PhD [ER] | Mayo Clinic<br>Rochester, MN |\n| Michael Patel, MD [MP] | Dana-Farber Cancer Institute<br>Boston, MA |\n| Jennifer Wilson, MD [JW] | UCLA Medical Center<br>Los Angeles, CA |\n| Robert Thompson, MD [RT] | Fred Hutchinson Cancer Center<br>Seattle, WA |\n| Natalie Kim, MD, PhD [NK] | Johns Hopkins Medicine<br>Baltimore, MD |\n| Thomas Garcia, MD [TG] | University of Chicago Medicine<br>Chicago, IL |\n| Aisha Johnson, MD, PhD [AJ] | Stanford Cancer Institute<br>Palo Alto, CA |\n| William Foster, MD [WF] | University of Pennsylvania<br>Philadelphia, PA |\n| Catherine Lee, MD [CL] | Oregon Health & Science University<br>Portland, OR |\n\nNovoGen\n\n| Name | Position |\n|---|---|\n| Richard Bennett [RB] | Senior Director, Oncology Training<br>Cambridge, MA |\n| Lisa Chen, MD, PhD [LC] | Medical Director<br>Cambridge, MA |\n| Sophia Martinez, PhD [SM] | Director of Medical Affairs<br>Cambridge, MA |\n| James Wilson [JWi] | Senior Manager<br>Cambridge, MA |\n| Kevin Park, PhD [KP] | Medical Science Liaison<br>Cambridge, MA |\n\nMedInsight Group\n\n| Name | Position |\n|---|---|\n| Andrew Miller | MedInsight Group<br>Chicago, IL |\n| Patricia Johnson, PhD | MedInsight Group<br>Boston, MA |\n| Raj Patel, PhD | MedInsight Group<br>San Francisco, CA |\n\nII. Agenda\n\nSaturday, March 18\n\n7:00 AM Breakfast",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 1,
            "chunk_length": 1418,
            "num_words": 229
        }
    },
    {
        "content": "7:45 AM Welcome, Introductions and Meeting Objectives Chairperson: Sarah Blackstone, MD, PhD\n\n8:00 AM Onculitis Mechanism of Action and Clinical Implications (20-min presentation/30-min discussion)\n\nPresenter: Michael Patel, MD\n\n8:50 AM Biomarker Development for Patient Selection (20-min presentation/35-min discussion) Presenter: Natalie Kim, MD, PhD\n\n9:45 AM Break (15 min)\n\n10:00 AM Efficacy in Various Tumor Types and Patient Populations (30-min presentation/45-min discussion) Presenter: Sarah Blackstone, MD, PhD\n\n11:15 AM Real-World Evidence and Treatment Strategies (25-min presentation/35-min discussion) Presenter: Jennifer Wilson, MD\n\n12:15 PM Lunch (ongoing discussion)\n\n1:00 PM Current Landscape of Precision Medicine in Oncology (20-min presentation/40-min discussion) Moderator: Elena Rodriguez, MD, PhD\n\n2:00 PM Workshop: Biomarker Implementation in Clinical Practice (2 breakouts) (60-min discussion) Moderator: Lisa Chen, MD, PhD, and Sophia Martinez, PhD\n\n3:00 PM Break (15 min)\n\n3:15 PM Workshop Recap (30 min)\n\n3:45 PM Final Comments, Sponsor and Chair Summaries\n\n4:00 PM Adjourn\n\nIII. Objectives",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 2,
            "chunk_length": 1118,
            "num_words": 147
        }
    },
    {
        "content": "Obtain expert feedback on: Onculitis mechanism of action and clinical implications in the context of patient selection Current state of biomarker development for predicting response to Onculitis Efficacy profile across various tumor types and patient subpopulations Real-world implementation of biomarker-guided treatment selection Strategies to optimize patient outcomes through precision medicine approaches\n\nPriorities for future biomarker research and validation studies\n\nIV. Top-line Summary\n\nOnculitis Mechanism of Action and Clinical Implications\n\nOnculitis's dual mechanism targeting both tumor cells and the microenvironment is unique and should be emphasized in communications with healthcare professionals Key talking points for Onculitis MOA should include: Selective inhibition of tumor-specific BCL-11 signaling Modulation of the tumor microenvironment to enhance immune recognition Minimal impact on normal tissue function\n\nThe ability of Onculitis to maintain efficacy in treatment-resistant populations is a key differentiator and needs further exploration Understanding the mechanistic interplay between Onculitis and specific tumor genetic profiles is essential for optimal patient selection Patients with high BCL-11 expression and specific immune signatures may be particularly good candidates for Onculitis therapy\n\nBiomarker Development for Patient Selection",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 3,
            "chunk_length": 1381,
            "num_words": 176
        }
    },
    {
        "content": "The current TR-74 assay shows promise but requires further validation across multiple tumor types and in real-world settings Standardization of testing methodologies is urgently needed to ensure consistent results across treatment centers\n\nThe composite biomarker approach combining BCL-11 expression, immune signatures, and tumor mutational burden shows greater predictive value than any single marker Development of an integrated scoring system is recommended to simplify clinical decision- making\n\nLiquid biopsy approaches for monitoring treatment response should be accelerated to provide real-time assessment of therapeutic efficacy This would allow for earlier intervention in non-responding patients\n\nTissue heterogeneity remains a significant challenge in biomarker assessment Multiple sampling or combined tissue/liquid approaches may be necessary for accurate patient selection\n\nEfficacy in Various Tumor Types and Patient Populations\n\nStrongest efficacy data remain in advanced Melanocarcinoma, but emerging evidence in renal and triple-negative breast cancers is promising The signal in glioblastoma multiforme (GBM) is particularly interesting and warrants dedicated investigation\n\nThe lack of efficacy data in diverse ethnic populations is a critical gap that must be addressed Hispanic and African American representation in clinical trials has been inadequate",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 4,
            "chunk_length": 1375,
            "num_words": 181
        }
    },
    {
        "content": "Age-related differences in response should be further explored, as preliminary data suggest potentially higher efficacy in younger patients Long-term efficacy data (>3 years) are needed to fully understand the durability of response and optimal treatment duration\n\nReal-World Evidence and Treatment Strategies\n\nEarly real-world evidence suggests that Onculitis effectiveness may extend beyond the strict criteria used in clinical trials Development of a comprehensive registry for patients receiving Onculitis in various settings is strongly recommended\n\nHealthcare provider education on proper biomarker interpretation and patient selection is critical for optimal implementation Consider development of a certification program for cancer centers using Onculitis\n\nTreatment sequencing strategies, particularly regarding the use of Onculitis before or after immunotherapy, require further investigation Current data suggest Onculitis may be particularly effective following immunotherapy failure\n\nV. Onculitis Mechanism of Action and Clinical Implications\n\nMoA -- General Feedback\n\nOnculitis's dual-target mechanism needs to be effectively communicated to physicians as it represents a unique approach to cancer treatment [SB, MP] The ability to selectively target tumor cells via BCL-11 inhibition while simultaneously modulating the tumor microenvironment distinguishes Onculitis from traditional targeted therapies [MP]",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 5,
            "chunk_length": 1422,
            "num_words": 182
        }
    },
    {
        "content": "There was strong consensus on the need for further mechanistic studies: The relationship between BCL-11 inhibition and downstream signaling pathways needs further clarification [NK]\n\nQuantitative assessment of the extent of pathway inhibition at current clinical dosing is needed [DC] Investigation of resistance mechanisms should be prioritized [ER]\n\nOne advisor underscored the importance of understanding how Onculitis interacts with pre- existing mutations in the tumor environment [WF] Mechanistic studies examining the interaction between Onculitis and common driver mutations (BRAF, RAS, p53) would provide valuable insights for patient selection\n\nQuestions from advisors centered around the following points: The optimal level of BCL-11 inhibition required for clinical efficacy [RT] Whether continuous or intermittent dosing would provide better long-term outcomes [TG] The potential for combination approaches with immunotherapies or targeted agents [JW] NovoGen Medical noted that preliminary data from the NAVIGATE-101 study examining combinations with checkpoint inhibitors will be presented at ASCO 2025\n\nOne advisor expressed concern about over-reliance on in vitro mechanistic studies, noting that the complex in vivo environment may significantly alter drug effects [CL]\n\nClinical Implications",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 6,
            "chunk_length": 1310,
            "num_words": 175
        }
    },
    {
        "content": "Understanding the MoA has direct implications for identifying patients most likely to benefit from Onculitis [SB, DC] Patients with high BCL-11 expression (>60% by IHC) consistently show better responses across tumor types [NK] The presence of specific immune signatures in the tumor microenvironment appears to correlate with enhanced efficacy [AJ]\n\nThe observed maintenance of efficacy in patients previously treated with multiple lines of therapy was highlighted as particularly important [JW] This suggests Onculitis may have unique advantages in treatment-resistant populations [MP] However, one advisor cautioned that the data in heavily pretreated patients remains limited and requires further confirmation [RT]\n\nThe role of Onculitis in the adjuvant setting was discussed: Current evidence does not support use in early-stage disease [DC] Biomarker-guided selection may identify high-risk early-stage patients who could benefit [ER] The adjuvant ONCU-PREVENT study was acknowledged as an important step in addressing this question [WF]\n\nAdditional Studies and Educational Needs\n\nAdvisors unanimously recommended developing clear educational materials explaining Onculitis's MoA in terms accessible to both clinicians and patients Complex signaling pathway information should be translated into practical treatment implications [JW] Visual aids demonstrating how BCL-11 inhibition affects both tumor cells and the microenvironment would be valuable [TG]",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 7,
            "chunk_length": 1460,
            "num_words": 197
        }
    },
    {
        "content": "The following additional mechanistic studies were suggested: Investigation of the kinetics of BCL-11 inhibition and recovery upon treatment interruption [WF] Analysis of tumor immune infiltrate changes before and after Onculitis treatment [AJ] Examination of potential biomarkers of resistance development [NK] Studies to determine if specific HLA types influence response to Onculitis [CL]\n\nOne advisor stressed the importance of developing companion diagnostic approaches that directly tie to the MoA [MP] \"Without robust diagnostics linked to the mechanism, we're essentially using Onculitis empirically rather than precisely\" [MP]\n\nVI. Biomarker Development for Patient Selection\n\nCurrent Biomarker Landscape\n\nThe TR-74 assay for BCL-11 expression shows promise but has important limitations [NK, general consensus] Sensitivity and specificity vary across tumor types, with best performance in Melanocarcinoma (sensitivity 78%, specificity 65%) [NK] Standardization across testing laboratories remains inconsistent [RT] \"The same patient sample can yield different results depending on where the test is performed\" [RT]\n\nCombining BCL-11 expression with immune signature assessment provides superior prediction of response [AJ] The 12-gene immune signature developed in the PREDICT-O study showed significant improvement in predictive value when combined with BCL-11 assessment [NK] Multiple advisors agreed this composite approach should be the focus of future development [SB, DC, MP]",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 8,
            "chunk_length": 1490,
            "num_words": 199
        }
    },
    {
        "content": "Tumor mutational burden (TMB) as an additional biomarker was discussed:\n\nHigh TMB (>10 mutations/megabase) appears to correlate with improved response to Onculitis [WF] The relationship between TMB and the BCL-11 pathway requires further investigation [NK] TMB assessment methods vary significantly between institutions, creating challenges for standardization [JW]\n\nCurrent tissue requirements for comprehensive biomarker assessment are problematic [general consensus] The need for multiple tests on limited tissue samples creates practical challenges [CL] Development of multiplexed assays was strongly recommended [TG]\n\nPredictive vs. Prognostic Biomarkers\n\nDistinction between predictive and prognostic value of current biomarkers remains unclear [SB] BCL-11 expression appears to be both predictive of Onculitis response and prognostic for overall disease course [NK] The immune signature shows stronger predictive than prognostic value [AJ]\n\nData from the control arms of randomized studies are needed to better distinguish predictive from prognostic value [DC] NovoGen Medical noted that such analyses from the BEACON study are underway\n\nValidation of biomarkers in the context of specific tumor types is essential [MP] What predicts response in Melanocarcinoma may differ from predictors in other solid tumors [ER] \"We need to avoid assuming biomarker performance will be consistent across different cancers\" [MP]",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 9,
            "chunk_length": 1421,
            "num_words": 193
        }
    },
    {
        "content": "Several advisors emphasized the importance of developing dynamic biomarkers for monitoring treatment response [JW, NK] Changes in circulating tumor DNA with BCL-11 mutations could provide real-time assessment of treatment efficacy [NK] Early response biomarkers could guide treatment duration decisions [TG]\n\nTumor Microenvironment Considerations\n\nThe tumor immune microenvironment significantly influences Onculitis efficacy [AJ, general consensus] Presence of tumor-infiltrating lymphocytes correlates with improved response [AJ] Specific T-cell subsets may be particularly important for efficacy [WF]\n\nSpatial distribution of immune cells relative to tumor cells appears relevant [AJ] Multiplex immunohistochemistry data suggest that proximity of CD8+ T cells to BCL-11 positive tumor cells predicts better outcomes [AJ] This spatial relationship should be incorporated into future biomarker development [SB]\n\nPre-existing immune evasion mechanisms may limit Onculitis efficacy despite appropriate BCL-11 expression [ER] Assessment of immune checkpoint expression (PD-L1, CTLA-4) may provide complementary information [DC] \"The BCL-11 positive tumor that exists in an immune desert may not respond as well as one with an inflamed microenvironment\" [ER]\n\nAdvisors recommended developing a comprehensive \"immune fitness score\" that could be combined with BCL-11 assessment [AJ, NK] This integrated approach would better capture the complexity of factors influencing response [SB]",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 10,
            "chunk_length": 1480,
            "num_words": 192
        }
    },
    {
        "content": "VII. Efficacy in Various Tumor Types and Patient Populations\n\nMelanocarcinoma Data\n\nThe strongest efficacy data for Onculitis remain in advanced Melanocarcinoma [SB] Overall response rate of 42% in biomarker-positive patients in the BEACON study is impressive for this population [SB] Median progression-free survival of 8.4 months compares favorably with current standards of care [TG]\n\nSubgroup analyses from BEACON highlight important patterns [MP] Patients with elevated BCL-11 expression (>60% by IHC) showed significantly better outcomes (ORR 58% vs 29%) [MP] Prior immunotherapy exposure did not negatively impact Onculitis efficacy [JW] \"This suggests Onculitis may be particularly valuable following immunotherapy failure\" [JW]\n\nLong-term follow-up data are encouraging but limited [DC] 3-year survival rate of 28% in biomarker-positive patients exceeds historical expectations [SB] Durability of response remains an open question requiring additional follow-up [RT]\n\nAdvisors noted that real-world effectiveness in Melanocarcinoma appears consistent with clinical trial data [JW]\n\nEarly registry data suggest similar response rates in clinical practice [JW] Safety profile has been manageable with appropriate patient selection [ER]\n\nOther Solid Tumors",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 11,
            "chunk_length": 1262,
            "num_words": 169
        }
    },
    {
        "content": "Emerging data in renal cell carcinoma (RCC) and triple-negative breast cancer (TNBC) show promise [SB] Phase 2 RCC data presented at GU ASCO showed ORR of 32% in biomarker-positive patients [SB] The TNBC cohort from the SPECTRUM basket trial demonstrated preliminary activity (ORR 26%) [CL]\n\nSeveral advisors expressed interest in the signal observed in glioblastoma multiforme (GBM) [NK, WF] Although preliminary (n=22), the 23% response rate in this difficult-to-treat population warrants further investigation [NK] Blood-brain barrier penetration data for Onculitis support its potential utility in CNS tumors [WF]\n\nThe lack of efficacy in colorectal cancer despite BCL-11 expression was discussed [TG] This suggests tumor-specific factors beyond BCL-11 expression influence response [TG] \"We need to better understand why BCL-11 inhibition works in some tumor types but not others\" [ER]\n\nMultiple advisors criticized the limited diversity in clinical trial populations [CL, AJ] Efficacy data in Hispanic and African American patients are particularly lacking [AJ] Potential differences in drug metabolism and efficacy across ethnic groups should be investigated [CL]\n\nTreatment-Resistant Populations",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 12,
            "chunk_length": 1203,
            "num_words": 168
        }
    },
    {
        "content": "Onculitis shows particular promise in patients who have exhausted standard treatment options [MP, general consensus] Data from the BEACON study's heavily pretreated cohort (≥3 prior lines) showed maintenance of efficacy (ORR 38%) [MP] This represents a significant unmet need in clinical practice [JW]\n\nThe efficacy profile in patients with poor prognostic features was highlighted [TG] Patients with elevated LDH and high tumor burden still demonstrated meaningful responses [SB]\n\nThis contrasts with the diminishing returns typically seen with other therapies in this population [RT]\n\nAge-related differences in efficacy should be further explored [ER] Preliminary data suggest potentially higher response rates in patients <65 years (47% vs 36%) [SB] Whether this reflects biological differences or confounding factors remains unclear [MP]\n\nOne advisor emphasized the importance of quality of life data in treatment-resistant populations [CL] \"In heavily pretreated patients, maintaining function and quality of life is often as important as extending survival\" [CL] Patient-reported outcomes showed stability or improvement in 68% of responders [SB]\n\nVIII. Real-World Evidence and Treatment Strategies\n\nCurrent Treatment Algorithms",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 13,
            "chunk_length": 1235,
            "num_words": 170
        }
    },
    {
        "content": "Integration of Onculitis into treatment algorithms varies significantly by institution and tumor type [JW] In Melanocarcinoma, most centers position Onculitis after immunotherapy and targeted therapy failure [JW] In other tumor types, usage remains primarily in the context of clinical trials or off-label in selected cases [DC]\n\nBiomarker testing rates are suboptimal and represent a barrier to appropriate Onculitis use [RT] Only approximately 60% of eligible patients currently receive BCL-11 testing [RT] This creates missed opportunities for potentially effective treatment [SB]\n\nTreatment sequencing is a critical consideration [MP, general consensus] Data suggesting maintained Onculitis efficacy post-immunotherapy has influenced sequencing decisions [JW] Whether Onculitis should precede or follow targeted therapies in appropriate patients remains unclear [TG] \"The sequencing question is one of the most common I face in clinical practice\" [MP]\n\nSeveral advisors stressed the importance of a multidisciplinary approach to Onculitis treatment decisions [AJ, WF] Molecular tumor boards that include pathologists familiar with BCL-11 testing improve patient selection [WF]\n\n\"This isn't a treatment that should be used in isolation from broader molecular and immune considerations\" [AJ]\n\nLong-term Safety Data",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 14,
            "chunk_length": 1316,
            "num_words": 178
        }
    },
    {
        "content": "Overall, the safety profile of Onculitis appears manageable with appropriate monitoring [ER] The most common grade 3-4 adverse events (neutropenia, fatigue, and transaminitis) are predictable and manageable [SB] The low rate of treatment discontinuation due to adverse events (8.2% in BEACON) is encouraging [JW]\n\nLong-term safety data beyond 3 years remain limited [CL] No unexpected safety signals have emerged in the extension studies, but patient numbers with >3 years of exposure are small [SB] The consequences of prolonged BCL-11 inhibition require continued monitoring [NK]\n\nRisk factors for severe adverse events were discussed [DC] Patients with baseline hepatic impairment appear to have higher rates of transaminitis [JW] Prior heavy pretreatment may increase the risk of hematologic toxicities [MP]\n\nOne advisor noted the importance of proactive management strategies [TG] \"Most of the adverse events can be effectively managed with dose modifications rather than discontinuation\" [TG] This approach has allowed maintenance of treatment in responding patients despite initial toxicities [ER]\n\nTreatment Sequencing\n\nThe optimal positioning of Onculitis in treatment sequences remains a key question [general consensus] Current usage patterns primarily position Onculitis after immunotherapy failure [JW] Limited data exist on the efficacy of immunotherapy following Onculitis [DC]",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 15,
            "chunk_length": 1392,
            "num_words": 194
        }
    },
    {
        "content": "Potential synergies with other treatment modalities were discussed [WF] Preclinical data suggest enhanced efficacy when combined with radiation therapy [WF] The ongoing COMBINE-O study examining Onculitis with low-dose ipilimumab will provide important insights [SB]\n\nSequential versus combination approaches were debated [MP, RT] Safety concerns with simultaneous administration of Onculitis and immunotherapy have led to preference for sequential approaches [RT]\n\n\"The toxicity profile of combinations needs extensive study before routine clinical use\" [MP]\n\nThe potential for Onculitis to sensitize tumors to subsequent therapies was highlighted as an area requiring investigation [NK] Anecdotal reports suggest improved responses to chemotherapy following Onculitis treatment [TG] This could significantly impact sequencing strategies if confirmed [SB]\n\nIX. Workshop: Biomarker Implementation in Clinical Practice\n\nCase Scenario 1\n\nPatient with recurrent Melanocarcinoma, BCL-11 expression 45% by IHC, high TMB (15 mut/Mb), and \"hot\" immune signature who progressed on immunotherapy and targeted therapy",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 16,
            "chunk_length": 1107,
            "num_words": 144
        }
    },
    {
        "content": "Clinical Considerations The composite biomarker profile of this patient was considered favorable for Onculitis treatment [general consensus] Although BCL-11 expression is below the optimal threshold (60%), the combination with high TMB and favorable immune signature suggests potential benefit [NK] \"This is exactly the type of patient where looking beyond a single biomarker is critical\" [AJ]\n\nTreatment decisions should consider the following factors [SB]: Rate of disease progression and symptom burden Patient performance status and comorbidities Prior treatment toxicities and duration of benefit from previous therapies Patient preferences and goals of care\n\nAlternative treatment options are limited in this setting [MP] Standard chemotherapy options offer ORRs of only 10-15% after immunotherapy and targeted therapy failure [MP] Clinical trials should always be considered but may not be accessible to all patients [DC]\n\nMonitoring strategy recommendations included [WF, JW]: Early imaging at 6-8 weeks to assess initial response Consideration of circulating tumor DNA monitoring if available Proactive management of potential adverse events, particularly fatigue and hepatic function\n\nOne advisor shared a similar case experience with favorable outcome [ER]\n\n\"We treated a patient with almost identical characteristics who achieved a partial response lasting 11 months\" [ER] This response occurred despite prior progression on multiple lines of therapy\n\nCase Scenario 2",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 17,
            "chunk_length": 1479,
            "num_words": 206
        }
    },
    {
        "content": "Patient with metastatic renal cell carcinoma, BCL-11 expression 75% by IHC, low TMB (4 mut/Mb), and \"cold\" immune signature who progressed on first-line immunotherapy combination\n\nClinical Considerations This case generated more debate among advisors regarding the appropriateness of Onculitis treatment The high BCL-11 expression favors treatment [NK] However, the low TMB and \"cold\" immune signature raise concerns about potential efficacy [AJ]\n\nMultiple factors were identified as relevant to the treatment decision [DC, TG]: The magnitude and speed of progression on first-line therapy The extent and location of metastatic disease Patient's age, performance status, and comorbidities Whether all standard treatment options have been exhausted\n\nAvailable data in RCC were reviewed [SB] The SPECTRUM trial showed lower response rates in \"cold\" immune signature patients (19% vs 38%) despite high BCL-11 expression [SB] Response duration was also shorter in this subgroup (5.2 months vs 7.8 months) [TG]\n\nAlternative treatment options included [RT, MP]: VEGF-TKI therapy (tivozanib, cabozantinib) mTOR inhibition Clinical trials of novel combinations\n\nOne advisor suggested a time-limited trial of Onculitis with early assessment [WF] \"Given the high BCL-11 expression, I would offer Onculitis with clear expectations and assessment at 8 weeks\" [WF] If no response is observed, prompt transition to alternative therapy would be warranted",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 18,
            "chunk_length": 1439,
            "num_words": 204
        }
    },
    {
        "content": "The importance of discussing uncertain benefit with the patient was emphasized [CL]\n\n\"This is a case where shared decision-making is particularly important given the conflicting biomarker information\" [CL] Clear communication about expectations and monitoring is essential [JW]\n\nX. Follow-up and Recommendations\n\nOnculitis MoA\n\nAdvisor Feedback:\n\nFurther investigation of the relationship between BCL-11 inhibition and downstream signaling pathways Quantitative assessment of BCL-11 inhibition at current clinical dosing Studies examining interaction between Onculitis and common driver mutations (BRAF, RAS, p53) Investigation of resistance mechanisms Assessment of intermittent versus continuous dosing regimens\n\nFollow-up Action:\n\nAll 5 recommendations will be forwarded to the Medical Affairs and Research and Development teams\n\nBiomarker Development\n\nAdvisor Feedback:\n\nValidation of the composite biomarker approach combining BCL-11 expression, immune signatures, and TMB Standardization of BCL-11 testing methodologies across laboratories Development of liquid biopsy approaches for monitoring treatment response Investigation of spatial relationships between immune cells and BCL-11 positive tumor cells\n\nFollow-up Action:\n\nFirst 2 recommendations will be forwarded to the Diagnostics and Commercial teams Recommendations will be forwarded to the Medical Affairs and Research and Development teams\n\nEfficacy and Real-World Evidence\n\nAdvisor Feedback:",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 19,
            "chunk_length": 1458,
            "num_words": 184
        }
    },
    {
        "content": "Expansion of efficacy data collection in diverse ethnic populations Further investigation of Onculitis in glioblastoma multiforme Development of a comprehensive patient registry for real-world outcomes data\n\nFollow-up Action:\n\nAll 3 recommendations will be forwarded to the Clinical Development and Medical Affairs teams\n\nEducational Needs\n\nAdvisor Feedback:\n\nDevelopment of clear educational materials explaining Onculitis's MoA for both clinicians and patients Creation of a certification program for cancer centers focusing on appropriate biomarker testing and interpretation\n\nFollow-up Action:\n\nBoth recommendations will be forwarded to the Medical Affairs and Medical Education teams",
        "metadata": {
            "file_name": "Onculitis Biomarker Development and Patient Selection Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 555427,
            "chunk_type": "pdf_chunk",
            "chunk_index": 20,
            "chunk_length": 688,
            "num_words": 89
        }
    },
    {
        "content": "Onculitis Unmet Needs Advisory Board\n\nThe Ritz-Carlton Hotel, Miami, FL\n\nSaturday, September 14, 2024\n\nPost-Meeting Report\n\nTable of Contents\n\nI. Participants\n\nII. Agenda\n\nIII. Objectives\n\nIV. Top-line Summary\n\nOnculitis Mechanism of Action and Clinical Implications Efficacy and Safety in Underrepresented Populations Population-Specific Response Factors Additional Data and Educational Recommendations\n\nV. Onculitis Mechanism of Action and Clinical Implications\n\nMoA -- General Feedback Genetic Variability Considerations Additional Studies and Educational Needs\n\nVI. Onculitis Efficacy in Diverse Patient Populations\n\nResponse Rates Across Populations Subgroup Analysis\n\nVII. Biomarker Development for Population-Specific Treatment\n\nCurrent Biomarker Usage Population Genomics Efficacy -- General Feedback Safety in Diverse Populations\n\nVIII. Real-World Evidence and Long-Term Outcomes\n\nLong-term Data Collection Post-Market Analyses\n\nIX. Access and Healthcare Disparities\n\nX. Workshop: Implementation Strategies (2 Case Scenarios)\n\nCase Scenario 1 Clinical Considerations Case Scenario 2 Clinical Considerations (2)\n\nXI. Follow-up and Recommendations\n\nI. Participants",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 0,
            "chunk_length": 1171,
            "num_words": 141
        }
    },
    {
        "content": "| [Chair]{.underline} |  |\n|---|---|\n| Helena Rojas, MD [HR] |  |\n| Memorial Sloan Kettering |  |\n| New York, NY |  |\n| [Advisors]{.underline} |  |\n| Marcus Chen, MD [MC] | Sophia Williams, MD [SW] |\n| UCLA Cancer Center | Mayo Clinic |\n| Los Angeles, CA | Rochester, MN |\n| Darnell Washington, MD [DW] | Amara Singh, MD [AS] |\n| Northwestern Medicine | MD Anderson Cancer Center |\n| Chicago, IL | Houston, TX |\n| Isaac Goldstein, MD [IG] | Maya Jefferson, MD [MJ] |\n| University of Pennsylvania | Howard University Hospital |\n| Philadelphia, PA | Washington, DC |\n| Li Wei Zhang, MD [LZ] | Carmen Vasquez, MD [CV] |\n| Stanford Cancer Institute | University of Miami |\n| Palo Alto, CA | Miami, FL |\n| Kenji Watanabe, MD, PhD [KW] | Zainab Al-Farsi, MD [ZA] |\n| Dana-Farber Cancer Institute | Cleveland Clinic |\n| Boston, MA | Cleveland, OH |\n| [BioPharma Company]{.underline} |  |\n| David Martinez [DM] | Jennifer Chen, MD [JC] |\n| Associate Director, Oncology | Director of Medical Affairs |\n| Boston, MA | Boston, MA |\n| Melissa Thompson, MD, PhD [MT] | Edward Phillips [EP] |\n| Medical Director | Senior Manager |\n| Boston, MA | Boston, MA |\n| Nathan Yeboah, PhD [NY] |  |\n| Medical Science Liaison |  |\n| Boston, MA |  |\n| [MedComm Agency]{.underline} |  |\n| Terri Anderson | Deepak Mehta, PhD |\n| MedComm Agency | MedComm Agency |\n| New York, NY Philadelphia, PA |  |\n\n| [Chair]{.underline} |  |\n|---|---|\n| Michelle Richards, PhD |  |\n| MedComm Agency |  |\n| Chicago, IL |  |\n\nII. Agenda",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 1,
            "chunk_length": 1493,
            "num_words": 291
        }
    },
    {
        "content": "Saturday, September 14\n\n7:00 AM - Breakfast\n\n7:45 AM - Welcome, Introductions and Meeting Objectives Chairperson: Helena Rojas, MD\n\n8:00 AM - Onculitis Mechanism of Action and Clinical Implications (20-min presentation/30-min discussion) Presenter: Isaac Goldstein, MD\n\n8:50 AM - Onculitis Efficacy in Diverse Patient Populations (20-min presentation/35-min discussion) Presenter: Maya Jefferson, MD\n\n9:45 AM - Break (15 min)\n\n10:00 AM - Biomarker Development for Population-Specific Treatment (30-min presentation/45-min discussion) Presenter: Li Wei Zhang, MD\n\n11:15 AM - Real-World Evidence and Long-Term Outcomes (25-min presentation/35-min discussion) Presenter: Carmen Vasquez, MD\n\n12:15 PM - Lunch (ongoing discussion)\n\n1:00 PM - Access and Healthcare Disparities (20-min presentation/40-min discussion) Moderator: Darnell Washington, MD\n\n2:00 PM - Workshop: Implementation Strategies (2 breakouts) (60-min discussion) Moderators: Jennifer Chen, MD, and Melissa Thompson, MD, PhD\n\n3:00 PM - Break (15 min)\n\n3:15 PM - Workshop Recap (30 min)\n\n3:45 PM - Final Comments, Sponsor and Chair Summaries\n\n4:00 PM - Adjourn\n\nIII. Objectives",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 2,
            "chunk_length": 1138,
            "num_words": 156
        }
    },
    {
        "content": "Obtain expert feedback on: Onculitis efficacy and safety profile in diverse ethnic populations Current gaps in clinical data for underrepresented patient groups Strategies to improve enrollment of diverse populations in clinical trials Potential genetic or physiological factors affecting treatment response across ethnic groups Real-world implementation challenges in diverse clinical settings Educational needs for healthcare providers treating ethnically diverse patient populations\n\nIV. Top-line Summary\n\nOnculitis Mechanism of Action and Clinical Implications\n\nIt is important to highlight that Onculitis selectively targets tumor cells through its dual mechanism of action, which offers advantages over conventional therapies for treating Melanocarcinoma This mechanism appears to function across diverse populations, but with potentially important variations that require further investigation\n\nThe MoA needs to be communicated in a clear, accessible way that resonates with both healthcare providers and patients from diverse backgrounds Key talking points for Onculitis MoA should include: Selective targeting of tumor cells with minimal impact on healthy tissues Dual inhibition of both PRTK2 and MTEK pathways Immune system modulation that enhances anti-tumor response",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 3,
            "chunk_length": 1279,
            "num_words": 169
        }
    },
    {
        "content": "The MoA needs to be further elucidated to better identify potential variability in treatment response across different ethnic populations Genetic polymorphisms affecting drug metabolism should be investigated as they may explain observed differences in efficacy and adverse events Understanding these variations could help optimize dosing strategies for specific populations\n\nEfficacy and Safety in Underrepresented Populations\n\nCurrent clinical trials for Onculitis have insufficient representation of non-White populations, particularly Black, Hispanic, and Asian patients This gap in data limits confidence in prescribing Onculitis for these populations\n\nThe efficacy and safety profiles observed in the limited data for diverse populations suggest potential differences that warrant further investigation: Preliminary data indicate higher response rates in Asian populations but with increased rates of certain adverse events Black patients showed variable response rates with some subgroups demonstrating exceptional outcomes Hispanic patients appear to have similar efficacy but may experience delayed onset of response\n\nAdvisors emphasized the urgent need for: Post-approval studies specifically designed to assess efficacy in diverse populations Real-world data collection stratified by ethnicity and genetic background Pharmacogenomic studies to identify predictive biomarkers of response in different ethnic groups",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 4,
            "chunk_length": 1424,
            "num_words": 184
        }
    },
    {
        "content": "Overall, Onculitis appears to maintain efficacy across populations, but optimizing its use requires population-specific considerations: Dosing adjustments may be necessary for certain groups Monitoring protocols might need customization based on population-specific adverse event profiles Combination strategies could be tailored to address population-specific resistance mechanisms\n\nPopulation-Specific Response Factors\n\nBiomarker development for predicting treatment response should include validation across diverse populations Current biomarkers may have variable predictive value across different ethnic groups\n\nGenetic polymorphisms affecting drug metabolism (particularly CYP3A4 and CYP2D6 variants) were identified as critical factors that may explain observed differences in treatment outcomes These variations are distributed differently across ethnic populations and may require pre- treatment screening\n\nTumor microenvironment characteristics appear to vary across ethnic groups, potentially influencing Onculitis efficacy\n\nStudies of these differences should be incorporated into future clinical development\n\nAdvisors recommended development of a population-adjusted dosing algorithm that accounts for these factors to optimize treatment outcomes\n\nAdditional Data and Educational Recommendations",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 5,
            "chunk_length": 1308,
            "num_words": 153
        }
    },
    {
        "content": "Specific educational initiatives are needed for healthcare providers: Materials highlighting population-specific considerations in Onculitis treatment Dosing guidance based on available pharmacogenomic data Case studies representing diverse patient populations\n\nResearch priorities identified include: Targeted enrollment of underrepresented populations in post-approval clinical trials Pharmacogenomic studies across diverse ethnic groups Real-world data collection with stratification by ethnicity and genetic background Investigation of drug interactions common in specific populations Development of novel biomarkers with cross-population validity\n\nPatient support programs should be culturally tailored and available in multiple languages Educational materials must reflect diverse patient populations and address population-specific concerns\n\nV. Onculitis Mechanism of Action and Clinical Implications\n\nMoA -- General Feedback\n\nOnculitis demonstrates a unique dual mechanism that distinguishes it from other therapies in the Melanocarcinoma treatment landscape The selective inhibition of PRTK2 combined with MTEK pathway modulation provides targeted activity with potentially lower off-target effects [IG, KW] This mechanism appears to be consistent across populations, though the magnitude of effect may vary [IG]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 6,
            "chunk_length": 1321,
            "num_words": 160
        }
    },
    {
        "content": "There was significant discussion about how the MoA might explain observed efficacy differences across ethnic populations: \"The PRTK2 inhibition component seems relatively consistent across populations, but the immunomodulatory effects show interesting variations that could explain some of the response differences we're seeing in practice.\" [MC]\n\n\"What's particularly interesting is how the secondary mechanism—the immune modulation— might interact differently with baseline immune system differences that we know exist across ethnic groups.\" [AS]\n\nAdvisors requested additional research into: Specific downstream signaling effects in cells derived from diverse patient populations [KW, LZ] Potential interaction with polymorphisms in related pathways known to vary by ethnicity [MC] How tumor microenvironment differences across populations affect drug activity [LZ]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 7,
            "chunk_length": 868,
            "num_words": 112
        }
    },
    {
        "content": "One advisor noted: \"We're only beginning to understand how fundamental differences in immune baseline function across populations might interact with drugs like Onculitis that have an immunomodulatory component.\" [MJ] Several advisors questioned the relationship between the MoA and observed differences in adverse event profiles: \"The higher rate of dermatologic adverse events in Asian populations could relate to differences in skin biology interacting with the drug's mechanism.\" [LZ] \"We need to determine if the hepatotoxicity signal we're seeing in some Hispanic patients is related to underlying genetic factors affecting drug metabolism or if it's a direct consequence of the drug's mechanism.\" [CV]\n\nGenetic Variability Considerations\n\nSeveral key polymorphisms were discussed as potentially important in explaining variable treatment responses: CYP3A4 variants that affect drug metabolism show significant differences across ethnic populations [AS, IG] PRTK2 receptor polymorphisms may alter binding affinity and downstream signaling [LZ] Immune-related genes influenced by the secondary mechanism of Onculitis demonstrate ethnic variability [KW]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 8,
            "chunk_length": 1157,
            "num_words": 155
        }
    },
    {
        "content": "\"The prevalence of the CYP3A4*1B allele varies dramatically between populations—from approximately 2-5% in Asian populations to 35-67% in African-descent populations. This could absolutely impact drug exposure and efficacy.\" [AS] One advisor emphasized: \"We should be investigating whether dosing adjustments based on these known polymorphisms could optimize outcomes across populations.\" [SW] The group recommended development of a comprehensive pharmacogenomic panel to guide Onculitis therapy:\n\n\"A pre-treatment genetic panel could help identify patients at risk for toxicity and those likely to have enhanced responses—this should be a priority for development.\" [IG]\n\nAdditional Studies and Educational Needs\n\nThe MoA of Onculitis must be communicated in an accessible way that resonates with diverse patient populations [general consensus] Current scientific explanations are too technical for many patients Educational materials should be culturally appropriate and available in multiple languages Visual aids demonstrating the MoA should include diverse patient representations\n\nThe following additional studies were recommended: In vitro studies using cell lines derived from diverse ethnic populations [KW, LZ] Pharmacogenomic analyses of samples from existing clinical trials stratified by ethnicity [AS] Dedicated pharmacokinetic studies in historically underrepresented populations [MJ] Tumor microenvironment characterization across ethnic groups [MC]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 9,
            "chunk_length": 1465,
            "num_words": 189
        }
    },
    {
        "content": "\"We need to be proactive rather than reactive in collecting this data—waiting until post-approval to understand these differences puts underrepresented patients at risk.\" [DW]\n\nVI. Onculitis Efficacy in Diverse Patient Populations\n\nResponse Rates Across Populations\n\nAdvisors discussed the limited but important data on differential response rates across ethnic populations: \"The ONCO-PRIME study data, though limited in diversity, suggests a trend toward higher overall response rates in Asian patients—approximately 68% compared to 52% in non- Hispanic White patients.\" [MJ] \"What's particularly concerning is the small sample sizes for Black and Hispanic patients in the pivotal trials—only 43 and 57 patients respectively. This doesn't give us the statistical power to make confident predictions about efficacy.\" [DW]\n\nSeveral participants shared observational data from their clinical practices: \"In my largely Hispanic patient population, I've observed similar efficacy to what was reported in the trials, but the onset of response seems delayed by approximately 3-4 weeks compared to what we typically expect.\" [CV] \"Among my Black patients, I've seen a wide variability in response—some have exceptional outcomes, others primary resistance. This suggests to me we're missing important",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 10,
            "chunk_length": 1292,
            "num_words": 182
        }
    },
    {
        "content": "stratification factors.\" [MJ] \"East Asian patients in my practice have shown robust responses, sometimes exceeding what we typically see, but with higher rates of certain toxicities that occasionally necessitate dose reductions.\" [MC]\n\nThe discussion highlighted the need for more robust data: \"These anecdotal observations are valuable but underscore the urgent need for prospective data collection in diverse populations.\" [HR] \"We need to be careful about making broad generalizations about 'Asian' or 'Hispanic' patients, as these are heterogeneous groups with important genetic and cultural differences.\" [LZ]\n\nThere was debate about how to interpret the current limited data: \"Even with small sample sizes, the consistency of some signals—like the increased efficacy in Asian populations—suggests real biological differences that warrant investigation.\" [KW] \"We should be cautious about overinterpreting subgroup analyses from trials that weren't powered to detect these differences.\" [SW]\n\nSubgroup Analysis",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 11,
            "chunk_length": 1015,
            "num_words": 139
        }
    },
    {
        "content": "The subgroup analyses from ONCO-PRIME and ONCO-HORIZON were reviewed in detail: Data showed potential trends in efficacy differences across ethnic groups, though many did not reach statistical significance due to small sample sizes [MJ] Progression-free survival appeared particularly strong in East Asian populations (median 11.4 months vs 8.7 months in the overall population) [LZ] Black patients showed similar overall response rates to White patients but potentially shorter duration of response [MJ]\n\nMajor limitations of these analyses were highlighted: \"The lumping of diverse Hispanic populations—from different countries with different genetic admixtures—limits the utility of these analyses.\" [CV] \"There was no consideration of genetic ancestry in these analyses, just self-reported race/ethnicity, which is a crude proxy for biological differences.\" [AS] \"Native American and Pacific Islander populations were virtually absent from the trials, yet we serve these populations and need guidance.\" [MC]\n\nRecommendations for future analyses included: Incorporation of genetic ancestry data rather than relying solely on self-reported race/ethnicity [AS]\n\nStratification of Hispanic populations by region of origin and genetic admixture [CV] Focused studies in populations entirely missing from current datasets [DW] \"We need to move beyond just including these populations as a checkbox and actually power studies to detect meaningful differences.\" [MJ]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 12,
            "chunk_length": 1461,
            "num_words": 200
        }
    },
    {
        "content": "VII. Biomarker Development for Population-Specific Treatment\n\nCurrent Biomarker Usage\n\nThe current PRTK2 expression biomarker was discussed as having potential limitations across populations: \"Our validation studies for the PRTK2 expression assay included predominantly White patients —we don't know if the cutoff values established are appropriate across all populations.\" [LZ] \"We've observed different baseline distributions of PRTK2 expression across ethnic groups in our institutional data, which suggests the standard cutoff may not be optimal for all populations.\" [KW]\n\nVariability in biomarker testing access was identified as a significant issue: \"Many hospitals serving predominantly minority populations lack access to advanced molecular testing, creating a de facto disparity in appropriate Onculitis use.\" [MJ] \"Even when testing is available, insurance coverage for these tests varies significantly and creates another barrier for underserved populations.\" [DW]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 13,
            "chunk_length": 976,
            "num_words": 129
        }
    },
    {
        "content": "Alternative or complementary biomarkers were proposed: \"Incorporating analysis of common polymorphisms in the MTEK pathway could enhance predictive value of the current biomarker across populations.\" [AS] \"We've been exploring immune signatures that might predict response to the immunomodulatory component of Onculitis, and these appear to have different distributions across ethnic groups.\" [KW] \"Simple clinical factors like LDH levels may have different predictive value in different populations and could be incorporated into a more holistic prediction model.\" [MC]\n\nPopulation Genomics\n\nAdvisors discussed how population-specific genomic factors influence treatment outcomes: \"The frequency of activating mutations in PRTK2 pathway genes varies significantly across populations. In our institutional database, we see rates of approximately 23% in non-Hispanic White patients compared to 37% in East Asian patients.\" [LZ]\n\n\"Beyond the primary target, we've observed ethnic differences in compensatory pathway activation that could affect resistance patterns.\" [KW]\n\nPharmacogenomic factors were emphasized as critical: \"CYP3A4 variants that affect Onculitis metabolism show dramatic differences in frequency across populations, potentially explaining some of the variability in both efficacy and toxicity.\" [AS] \"Phase I metabolism of Onculitis involves multiple enzymatic pathways with known ethnic variability, yet current dosing recommendations don't account for these differences.\" [IG]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 14,
            "chunk_length": 1495,
            "num_words": 195
        }
    },
    {
        "content": "The integration of genomic information into clinical decision-making was discussed: \"We need practical guidelines that help clinicians incorporate what we already know about genomic differences across populations into treatment decisions.\" [DW] \"A decision-support algorithm that integrates tumor genomics, germline pharmacogenomics, and clinical factors could help optimize treatment across diverse populations.\" [SW]\n\nEfficacy -- General Feedback\n\nThe overall perception of Onculitis efficacy across populations was generally positive: \"Despite the limitations in our data, Onculitis appears to maintain activity across all studied populations, which is reassuring.\" [SW] \"The consistency of the mechanism across populations provides a strong rationale for efficacy, even as we work to optimize use in specific groups.\" [IG]\n\nImportant caveats were raised: \"We should acknowledge that 'non-inferior' efficacy across populations might still represent a missed opportunity for optimized treatment if population-specific factors aren't considered.\" [MJ] \"The focus shouldn't just be on whether the drug works in diverse populations, but how to ensure optimal outcomes through personalized approaches.\" [DW]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 15,
            "chunk_length": 1205,
            "num_words": 159
        }
    },
    {
        "content": "Advisors provided recommendations for enhancing efficacy data: \"Post-approval studies should be designed with pre-specified analyses of efficacy by ethnic group, with adequate power to detect clinically meaningful differences.\" [AS] \"Real-world evidence collection should prioritize sites serving diverse populations and ensure comprehensive collection of ethnicity data.\" [CV] \"Collaboration with international sites in regions underrepresented in the pivotal trials could rapidly generate complementary data.\" [MC]\n\nSafety in Diverse Populations\n\nSeveral population-specific safety signals were discussed: \"The increased rate of grade 3+ dermatologic toxicity in Asian patients (22% vs 11% in the overall population) needs further characterization and management guidance.\" [LZ] \"We've observed potentially higher rates of hepatotoxicity in Hispanic patients, though the numbers are too small for definitive conclusions.\" [CV] \"The neurotoxicity profile appears relatively consistent across populations, which is reassuring.\" [MJ]\n\nImplications for monitoring were addressed: \"Population-specific adverse event profiles may warrant customized monitoring schedules— more frequent LFT monitoring for Hispanic patients, for example.\" [IG] \"Lower starting doses with careful titration might be appropriate in populations with known higher rates of serious adverse events.\" [SW]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 16,
            "chunk_length": 1375,
            "num_words": 174
        }
    },
    {
        "content": "The impact of comorbidities common in specific populations was highlighted: \"Higher rates of hepatic steatosis in Hispanic populations may contribute to the hepatotoxicity signal and require special consideration.\" [CV] \"Diabetes is more prevalent in certain minority populations and may influence the risk profile of Onculitis—this interaction requires study.\" [DW]\n\nVIII. Real-World Evidence and Long-Term Outcomes\n\nLong-term Data Collection\n\nThe importance of ethnicity-stratified long-term data was emphasized: \"Without intentional efforts to collect long-term outcomes data in diverse populations, the evidence gaps we currently face will persist or widen.\" [CV] \"Extended follow-up of minority patients from the existing trials should be prioritized, even if sample sizes are small.\" [DW]\n\nSpecific long-term outcomes of interest were identified: \"We need to understand if the patterns of resistance differ across populations, which could inform sequencing strategies.\" [KW] \"Long-term safety signals may emerge differently across populations—we've seen this with other oncology drugs where certain toxicities appeared later and disproportionately in specific groups.\" [MJ]\n\nCollaborative approaches to data collection were proposed:",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 17,
            "chunk_length": 1239,
            "num_words": 164
        }
    },
    {
        "content": "\"A registry focused specifically on underrepresented populations receiving Onculitis could efficiently generate valuable data.\" [HR] \"Partnership with community oncology practices serving diverse populations should be a priority for real-world data collection.\" [DW] \"International collaborations, particularly with centers in Asia, Africa, and Latin America, could enhance our understanding of population differences.\" [MC]\n\nPost-Market Analyses\n\nSeveral opportunities for post-market analyses were identified: \"Claims database analyses stratified by ethnicity (where available) could provide early signals of differential outcomes.\" [SW] \"Analysis of EHR data from healthcare systems serving diverse populations could provide rapid insights into real-world patterns of response and toxicity.\" [DW]\n\nMethodology recommendations included: \"Standard for reporting ethnicity in post-market studies should be established and enforced— too often this critical variable is missing or inconsistently categorized.\" [MJ] \"Propensity score matching approaches could help address some of the confounding factors that differ across populations, like access to care and comorbidities.\" [AS]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 18,
            "chunk_length": 1178,
            "num_words": 147
        }
    },
    {
        "content": "Integration with clinical practice was discussed: \"Findings from post-market analyses should rapidly inform updates to prescribing information and clinical decision support tools.\" [IG] \"A dynamic feedback loop between real-world evidence collection and clinical practice would benefit all patients, but especially those underrepresented in trials.\" [HR]\n\nIX. Access and Healthcare Disparities\n\nAdvisors highlighted how disparities in access affect Onculitis utilization: \"The requirement for companion diagnostic testing creates an additional barrier for underserved populations who often receive care at facilities without this capability.\" [MJ] \"Complex prior authorization requirements disproportionately impact practices serving minority populations that may have fewer administrative resources.\" [DW] \"Out-of-pocket costs create significant barriers for patients without robust insurance coverage, which disproportionately affects certain minority groups.\" [CV]\n\nImpact of geographical disparities was emphasized:\n\n\"Rural areas with higher proportions of certain minority populations often lack access to oncologists familiar with newer therapies like Onculitis.\" [SW] \"The distribution of clinical trial sites for Onculitis studies demonstrated significant geographical bias away from areas with high minority populations.\" [DW]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 19,
            "chunk_length": 1335,
            "num_words": 165
        }
    },
    {
        "content": "Cultural factors affecting Onculitis utilization were discussed: \"Language barriers significantly impact understanding of complex treatment options like Onculitis, especially regarding risk/benefit discussions.\" [CV] \"Cultural attitudes toward clinical trials and novel therapies vary significantly and affect willingness to consider Onculitis as a treatment option.\" [ZA] \"Lack of diverse representation in educational materials and support programs may subtly signal to patients that the therapy isn't 'for them'.\" [MJ]\n\nRecommendations to address these disparities included: \"Patient support programs should be designed with input from diverse populations and available in multiple languages.\" [CV] \"Educational initiatives specifically targeting healthcare providers serving minority populations should be prioritized.\" [DW] \"Partnerships with advocacy organizations representing diverse communities could enhance awareness and appropriate utilization.\" [MJ] \"Telehealth consultations with specialists could help extend expertise to underserved areas.\" [SW]\n\nX. Workshop: Implementation Strategies (2 Case Scenarios)\n\nCase Scenario 1\n\n58-year-old Black female with relapsed Melanocarcinoma after first-line therapy, with moderate hepatic steatosis and controlled type 2 diabetes. Additional patient characteristics: PRTK2 expression at 25% (just above the standard 20% cutoff), lives in rural area with limited access to specialized care.\n\nClinical Considerations",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 20,
            "chunk_length": 1467,
            "num_words": 181
        }
    },
    {
        "content": "Treatment decisions for this patient should account for multiple factors: \"The PRTK2 expression level of 25% would typically qualify this patient for Onculitis, but we should consider that our cutoff validation studies included very few Black patients.\" [MJ] \"Given the hepatic steatosis, which appears more common in certain populations, additional baseline LFT monitoring would be prudent before starting therapy.\" [IG]\n\n\"We should consider pharmacogenomic testing if available, given that CYP variants common in patients of African ancestry might affect drug metabolism.\" [AS]\n\nIndividual factors influencing the decision: \"Diabetes appears well-controlled, but we should ensure close monitoring as hyperglycemia has been reported with Onculitis in approximately 15% of patients.\" [SW] \"The rural location raises concerns about monitoring—a more robust telehealth follow-up plan might be appropriate.\" [DW] \"I would strongly consider starting at 75% of the standard dose with careful titration based on tolerability, given the combination of factors that might increase toxicity risk.\" [CV]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 21,
            "chunk_length": 1093,
            "num_words": 153
        }
    },
    {
        "content": "Several advisors shared similar anecdotal experiences: \"I've treated several Black female patients with similar profiles and generally observed good efficacy, though time to response seemed somewhat longer than in the overall trial population.\" [MJ] \"In my practice, patients with similar characteristics have required more proactive supportive care, particularly for management of fatigue which seemed more pronounced.\" [DW]\n\nConsensus recommendations for this case included: More intensive early monitoring (weeks 1, 2, 4) compared to standard (weeks 4, 8, 12) Consideration of reduced starting dose with titration based on tolerability Proactive supportive care plan with telehealth integration for accessibility Involvement of diabetes management team from the outset\n\nCase Scenario 2\n\n42-year-old Hispanic male with relapsed Melanocarcinoma and high PRTK2 expression (60%), previously treated with immunotherapy with grade 2 immune-mediated hepatitis that resolved. Additional patient characteristics: Limited English proficiency, robust family support system, lives in urban area with access to major medical center.\n\nClinical Considerations",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 22,
            "chunk_length": 1147,
            "num_words": 152
        }
    },
    {
        "content": "Treatment approach discussions centered around several key considerations: \"The history of immune-mediated hepatitis requires careful consideration given the potential hepatotoxicity signal observed in Hispanic patients on Onculitis.\" [CV] \"The high PRTK2 expression suggests potential for strong response, but we need more robust baseline testing before initiating therapy.\" [MC]\n\n\"The language barrier is critical to address—all education and consent must be provided in the patient's preferred language with professional medical interpretation.\" [CV]\n\nThe importance of family involvement was emphasized: \"The robust family support system is an asset we should leverage through inclusive education and involvement in monitoring plans.\" [DW] \"Cultural factors around family decision-making should be respected and incorporated into the treatment planning process.\" [CV]\n\nMonitoring considerations included: \"More frequent LFT monitoring is essential given both the history of hepatitis and the potential population-specific risk.\" [IG] \"I would consider prophylactic use of hepatoprotective agents, though this is not in current guidelines and would be an off-label approach.\" [CV] \"Early imaging assessment at 6 weeks rather than the standard 9 weeks would help identify exceptional responders who might benefit from dose modification to enhance tolerability.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 23,
            "chunk_length": 1368,
            "num_words": 184
        }
    },
    {
        "content": "Similar cases were shared: \"In my practice with predominantly Hispanic patients, I've observed excellent responses to Onculitis in those with high PRTK2 expression, but also more frequent dose interruptions due to transaminitis.\" [CV] \"We've implemented a modified monitoring protocol for our Hispanic patients with additional LFT checks and it has reduced the rate of serious hepatotoxicity.\" [MC]\n\nConsensus recommendations for this case included: Provision of all materials in the patient's preferred language with professional medical interpretation for all visits Weekly LFT monitoring for the first month, then biweekly for two months Family inclusion in education about monitoring for adverse events Earlier response assessment to guide potential dose modification Consideration of nutrition consultation regarding diet optimization during treatment\n\nXI. Follow-up and Recommendations",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 24,
            "chunk_length": 891,
            "num_words": 121
        }
    },
    {
        "content": "| ADVISOR FEEDBACK | FOLLOW-UP ACTION |\n|---|---|\n| Onculitis MoA |  |\n| • Conduct in vitro studies using cell lines derived from\ndiverse populations to characterize pathway inhibition | • All 5 recommendations will be forwarded to the\nMedical Affairs and Research and Development\nteams |\n| • Investigate potential differences in PRTK2 receptor\npolymorphisms across ethnic groups |  |\n| • Evaluate immune system modulation effects across\nethnically diverse populations |  |\n| • Develop educational materials explaining MoA in\nculturally appropriate ways and multiple languages |  |\n| • Investigate interaction between Onculitis MoA and\ncommon comorbidities in specific populations |  |\n| Efficacy in Diverse Populations |  |\n| • Design and implement a post-approval study with\nenhanced recruitment of underrepresented populations | • Recommendations will be forwarded to the Medical\nAffairs and Commercial teams |\n| • Develop a registry specifically focused on outcomes in\nethnic minority patients |  |\n| • Analyze existing trial data with genetic ancestry\napproaches rather than self-reported race/ethnicity\ncategories |  |\n| Biomarker Development |  |\n| • Validate existing PRTK2 expression cutoffs in diverse\npopulations | • All recommendations will be forwarded to the\nMedical Affairs and Research and Development\nteams |\n| • Develop comprehensive pharmacogenomic panel to\nguide treatment decisions |  |\n| • Investigate complementary biomarkers that may\nenhance predictive value across",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_sub_chunk_from_table",
            "chunk_index": 25,
            "chunk_length": 1489,
            "num_words": 228,
            "original_page_num_of_element": 18,
            "original_element_type": "table"
        }
    },
    {
        "content": "nd Research and Development\nteams |\n| • Develop comprehensive pharmacogenomic panel to\nguide treatment decisions |  |\n| • Investigate complementary biomarkers that may\nenhance predictive value across populations |  |\n| Clinical Practice |  |\n| • Develop population-specific monitoring guidelines\naddressing known differential toxicity risks | • Recommendations will be forwarded to the Medical\nAffairs and Commercial teams |\n| • Create dosing algorithms that incorporate\npharmacogenomic information when available |  |",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_sub_chunk_from_table",
            "chunk_index": 26,
            "chunk_length": 518,
            "num_words": 75,
            "original_page_num_of_element": 18,
            "original_element_type": "table"
        }
    },
    {
        "content": "| ADVISOR FEEDBACK | FOLLOW-UP ACTION |\n|---|---|\n| • Ensure patient materials are culturally appropriate and\navailable in multiple languages |  |",
        "metadata": {
            "file_name": "Onculitis Unmet Needs Advisory Board Transcript.pdf",
            "file_type": "pdf",
            "file_size": 668553,
            "chunk_type": "pdf_chunk",
            "chunk_index": 27,
            "chunk_length": 146,
            "num_words": 23
        }
    },
    {
        "content": "Onculitis Efficacy Advisory Board\n\nThe Grand Hyatt, Boston, MA\n\nFriday, April 17, 2025\n\nPost-Meeting Report\n\nTable of Contents\n\nI. Participants\n\nII. Agenda\n\nIII. Objectives\n\nIV. Top-line Summary\n\nV. Onculitis MoA and Clinical Implications\n\nVI. Onculitis Efficacy in Patients With Early Stage Disease (RESTORE)\n\nVII. Onculitis Efficacy in Patients With Advanced Disease (Phase 2, VISION, and CLARITY)\n\nVIII. Onculitis Extension Data and Post Hoc Analyses\n\nIX. Complete Response: Concepts and Relationship to Onculitis\n\nX. Workshop: Complete Response in Clinical Practice (2 Case Scenarios)\n\nXI. Follow-up and Recommendations\n\nI. Participants\n\n| [Chair] |\n|---|\n| Dr. Sarah Carlson |\n| Memorial Sloan Kettering Cancer Center |\n| New York, NY |\n\n|  |\n|---|\n|  |",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 0,
            "chunk_length": 758,
            "num_words": 114
        }
    },
    {
        "content": "| [Advisors]\nDr. Michael Chen [MC] Dr. Elena Rodriguez [ER]\nMD Anderson Cancer Center Mayo Clinic\nHouston, TX Rochester, MN\nDr. David Park [DP] Dr. Jennifer Wilson [JW]\nNorthwestern University Dana-Farber Cancer Institute\nChicago, IL Boston, MA\nDr. Thomas Grayson [TG] Dr. Maya Henderson [MH]\nFred Hutchinson Cancer Center University of California, San Francisco\nSeattle, WA San Francisco, CA\nDr. Robert Fisher [RF] Dr. Lisa Bennett [LB]\nCleveland Clinic Johns Hopkins\nCleveland, OH Baltimore, MD\nDr. William Kim [WK] Dr. Catherine Taylor [CT]\nMount Sinai Hospital Massachusetts General Hospital\nNew York, NY Boston, MA\nDr. Richard Torres [RT]\nUCLA Medical Center\nLos Angeles, CA |\n|---|\n|  |\n| [NovelOncology]\nDr. James Matthews [JM] Dr. Andrea Klein [AK]\nChief Medical Officer Director of Medical Affairs\nBoston, MA Boston, MA\nSarah Johnson [SJ] Dr. Mei Lin [ML]\nAssociate Director, Oncology Training Senior Medical Science Liaison\nBoston, MA Boston, MA\nDr. Marcus Davidson [MD]\nMedical Director\nBoston, MA |",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 1,
            "chunk_length": 1010,
            "num_words": 157
        }
    },
    {
        "content": "| [Advisors] |  |\n|---|---|\n| Dr. Michael Chen [MC] | Dr. Elena Rodriguez [ER] |\n| MD Anderson Cancer Center | Mayo Clinic |\n| Houston, TX | Rochester, MN |\n| Dr. David Park [DP] | Dr. Jennifer Wilson [JW] |\n| Northwestern University | Dana-Farber Cancer Institute |\n| Chicago, IL | Boston, MA |\n| Dr. Thomas Grayson [TG] | Dr. Maya Henderson [MH] |\n| Fred Hutchinson Cancer Center | University of California, San Francisco |\n| Seattle, WA | San Francisco, CA |\n| Dr. Robert Fisher [RF] | Dr. Lisa Bennett [LB] |\n| Cleveland Clinic | Johns Hopkins |\n| Cleveland, OH | Baltimore, MD |\n| Dr. William Kim [WK] | Dr. Catherine Taylor [CT] |\n| Mount Sinai Hospital | Massachusetts General Hospital |\n| New York, NY | Boston, MA |\n| Dr. Richard Torres [RT] |  |\n| UCLA Medical Center |  |\n| Los Angeles, CA |  |\n\n|  |  |\n|---|---|\n| [NovelOncology] |  |\n| Dr. James Matthews [JM] | Dr. Andrea Klein [AK] |\n| Chief Medical Officer | Director of Medical Affairs |\n| Boston, MA | Boston, MA |\n| Sarah Johnson [SJ] | Dr. Mei Lin [ML] |\n| Associate Director, Oncology Training | Senior Medical Science Liaison |\n| Boston, MA | Boston, MA |\n| Dr. Marcus Davidson [MD] |  |\n| Medical Director |  |\n| Boston, MA |  |\n\n|  |\n|---|\n|  |\n\n| [BioPharma Solutions Group] |  |\n|---|---|\n| Aiden Thompson | Dr. Rebecca Martin |\n| BioPharma Solutions Group | BioPharma Solutions Group |\n| Chicago, IL | Washington, DC |\n| Dr. Steven Taylor |  |\n| BioPharma Solutions Group |  |\n| San Francisco, CA |  |\n\nII. Agenda",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 2,
            "chunk_length": 1491,
            "num_words": 298
        }
    },
    {
        "content": "Friday, April 17\n\n7:00 AM Breakfast\n\n7:45 AM Welcome, Introductions and Meeting Objectives Chairperson: Dr. Sarah Carlson\n\n8:00 AM Onculitis MoA and Clinical Implications (20-min presentation/30-min discussion) Presenter: Dr. Thomas Grayson\n\n8:50 AM Onculitis Efficacy in Patients With Early Stage Disease (RESTORE) (20-min presentation/35-min discussion) Presenter: Dr. William Kim\n\n9:45 AM Break (15 min)\n\n10:00 AM Onculitis Efficacy in Patients With Advanced Disease (Phase 2, VISION, and CLARITY) (30-min presentation/45-min discussion) Presenter: Dr. Sarah Carlson\n\n11:15 AM Onculitis Extension Data and Post Hoc Analyses (25-min presentation/35-min discussion) Presenter: Dr. Jennifer Wilson\n\n12:15 PM Lunch (ongoing discussion)\n\n1:00 PM Complete Response: Concepts and Relationship to Onculitis (20-min presentation/40-min discussion) Moderator: Dr. Elena Rodriguez\n\n2:00 PM Workshop: Complete Response in Clinical Practice (2 breakouts) (60-min discussion) Moderators: Dr. James Matthews and Dr. Marcus Davidson\n\n3:00 PM Break (15 min)\n\n3:15 PM Workshop Recap (30 min)\n\n3:45 PM Final Comments, Sponsor and Chair Summaries\n\n4:00 PM Adjourn\n\nIII. Objectives",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 3,
            "chunk_length": 1163,
            "num_words": 156
        }
    },
    {
        "content": "Obtain expert feedback on: Onculitis efficacy in patients with advanced and early-stage disease Mechanism of action (MoA) and clinical implications Real-world applicability of complete response (CR) as a treatment goal CR results with Onculitis and other therapies, and implications for Onculitis's place in the current treatment paradigm\n\nIV. Top-line Summary\n\nOnculitis MoA and Clinical Implications\n\nIt is important to highlight that Onculitis works through selective targeting of the PRKL7 pathway in malignant cells with minimal impact on healthy tissue, unlike many conventional therapies. This is crucial and central to treatment decisions and sequencing The MoA needs to be communicated in a simple and effective way instead of presenting complicated molecular signaling pathways that do not resonate with patients Key talking points for Onculitis MoA include the following: Selectively targets cancer cells with PRKL7 overexpression Disrupts tumor metabolism while preserving healthy tissue function Synergizes with the immune system to enhance tumor clearance\n\nThe MoA needs to be further elucidated to better identify the most appropriate patient for Onculitis treatment Patients with high PRKL7 expression may be ideal candidates for Onculitis\n\nUnderstanding the complete mechanism of selective targeting would enhance physician comfort level with this drug\n\nEfficacy and Safety of Onculitis: Phase 2, RESTORE, VISION, and CLARITY",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 4,
            "chunk_length": 1442,
            "num_words": 205
        }
    },
    {
        "content": "Based on patients included in the Onculitis trials, Onculitis may be suitable for patients with aggressive disease; this message must be communicated to clinicians and patients Radiographic assessment and the subgroup analysis data from clinical trials confirm that Onculitis is more efficacious in patients with more advanced and PRKL7-overexpressing disease activity Patients switched from conventional chemotherapy to Onculitis have remained stable, adding to the body of evidence that Onculitis is indeed effective in patients with advanced disease Lack of information on effect of Onculitis in different ethnic groups (African Americans vs Caucasians) was criticized\n\nThe RESTORE data are reassuring and enhance comfort level for use of Onculitis in patients newly diagnosed with early-stage disease Advisors concurred that Onculitis has very strong long-term data (more than 5 years), unlike many other targeted oncology agents; it is encouraging to know that patients did well for more than 5 years Tumor burden reduction rather than simple response rate should be an endpoint, as it correlates with improved survival and quality of life Number needed to treat (NNT) data show that most drugs are more similar than different. Hence, it is important to communicate differences in MoA Onculitis NNT data for radiographic response need to be presented",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 5,
            "chunk_length": 1355,
            "num_words": 203
        }
    },
    {
        "content": "Advisors agreed that the weekly dosing of Onculitis was an advantage over the daily dosing regimens of many competitors Overall, Onculitis is well tolerated There have been a few cases of severe fatigue and transient neuropathy leading to treatment discontinuation\n\nComplete Response: Concepts and Relationship to Onculitis\n\nComplete Response was considered by all to be a relevant outcome measure Limitations include the lack of quality of life assessment, making CR unusable in some patient situations For these patients, sustained disease control with preserved functional status may be a more realistic treatment goal\n\nAnother drawback is the lack of concrete evidence in support of the prognostic ability of CR 3- 5 years after a treatment is initiated\n\nMicrometastatic disease clearance is a desirable component of CR assessment, although it is confounded by variability in the techniques used to detect minimal residual disease Although the concept of CR has always been integrated into clinical practice, there is ambiguity surrounding its implementation in certain disease states\n\nAdditional Data and Educational Recommendations",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 6,
            "chunk_length": 1137,
            "num_words": 168
        }
    },
    {
        "content": "Specific mechanisms that detail the preservation of normal cellular processes and functions with Onculitis must be investigated The magnitude of the effect of Onculitis on PRKL7-expressing cells and the dose required to achieve full enzymatic inhibition need to be assessed The time frame of when cancer cells develop resistance to Onculitis needs to be investigated\n\nRadiographic activity in patients who discontinued the trial should be pursued; this evaluation will provide insight into disease activity in the absence of continuous treatment Real-world patient outcomes including effect of treatment on quality of life, functional status, and activities of daily living need to be captured Patient communication should include presentations on expected adverse events, particularly fatigue and neuropathy, with strategies for management\n\nV. Onculitis MoA and Clinical Implications\n\nMoA – General Feedback\n\nOnculitis does not cause damage to healthy tissue—this message is central to the MoA and must be emphasized and effectively communicated. This sets the drug apart from other oncology therapies (eg, traditional chemotherapy), which affect normal cell integrity, and plays an important role in treatment decisions and sequencing [TG, MH] Onculitis selectively targets malignant cells overexpressing PRKL7, thus affecting tumor metabolism and growth [TG]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 7,
            "chunk_length": 1361,
            "num_words": 193
        }
    },
    {
        "content": "There was an overwhelming request for further advancing Onculitis MoA research It is imperative to understand whether some of the normal cellular processes are preserved with Onculitis treatment; therefore, investing in such studies is of immense value [TG] MoA needs to be studied in more detail with regards to mechanistic rationale for patient selection, treatment sequencing, and observation of certain adverse effects with Onculitis [general consensus]\n\nFurther elucidation of mechanisms will help carve out a distinct patient population that is most suitable for Onculitis [ER]\n\nAdvisor queries centered around the following points regarding the MoA of Onculitis: The clinical dose equivalent of 200 mg/kg of Onculitis in animal models [WK] The magnitude of the effect of Onculitis on PRKL7 expression; the proportion of high versus low expressing cells being affected [WK, RT] NovelOncology Medical noted that there was a mean reduction of PRKL7 activity by 85% in the pooled trial data though the circulating biomarkers remained within detectable range. Data from additional biomarker analyses in the RESPONSE study will be presented at ASCO 2025",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 8,
            "chunk_length": 1154,
            "num_words": 174
        }
    },
    {
        "content": "The remaining quantity of active PRKL7 following Onculitis administration [RT] Similar molecular pathway drugs reduce tumor burden by 45%. Similar information is required for Onculitis, since MoA is a key communication point to patients [MC] NovelOncology Medical clarified that experience with PRKL7 inhibition extends over the past 10 years, and a lot of mechanistic information about this pathway has been uncovered\n\nOne advisor pointed out that extrapolation of other PRKL7 inhibitor findings to Onculitis is insufficient in delineating the precise MoA of Onculitis [MC] One advisor voiced skepticism around the need for a detailed MoA investigation since most drugs are prescribed based on clinician and patient perception rather than mechanistic actions [JW]\n\nSafety Considerations",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 9,
            "chunk_length": 787,
            "num_words": 114
        }
    },
    {
        "content": "Important to identify the MoA regarding the observed neuropathy effects in clinical studies. One advisor noted the availability of a poster showing no difference in nerve conduction studies before and after the discontinuation of Onculitis [MC] Knowledge about the exact mechanism of neuropathy with Onculitis will increase comfort level [MC] Although cardiotoxicity outcomes with competing drugs are unsatisfactory, physicians continue to prescribe those medications to elderly patients due to their comfort with established safety profiles [JS] As of this date, the Onculitis registries have not demonstrated any red flags, but it is imperative that physicians adhere to the recommended monitoring guidelines [TG]\n\nThere was a request to conduct additional safety studies in elderly patients [JW]\n\nAdditional Studies and Educational Needs\n\nThe MoA of Onculitis must be communicated in a simple and effective way [general consensus] The PRKL7 signaling pathway story is complicated to communicate to patients There are other drugs with simpler MoA explanations\n\nKey takeaway is the selective targeting, not broad cytotoxicity [TG] Effect of Onculitis on both primary tumor and metastatic sites needs to be emphasized Clearly differentiate between mechanisms of targeted therapy and traditional chemotherapy for patients [MH]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 10,
            "chunk_length": 1325,
            "num_words": 191
        }
    },
    {
        "content": "The following need to be studied: Recovery from adverse events (severity and duration) and the associated time frame upon discontinuation of treatment [CT, JS] Effect of Onculitis on neuropathy development and resolution [MC]\n\nVI. Onculitis Efficacy in Patients With Early Stage Disease (RESTORE)\n\nTypically, advisors treat patients early in the course of the disease [general consensus] However, nowadays clinicians see fewer patients with very early stage disease due to improved screening [SC]\n\nRadiographic Disease Activity\n\nFor the data showing the risk of progression or radiographic response, the 12-week time point should be considered as a baseline [MC, RT] A true separation between the active therapy groups and the placebo group is seen at 24 weeks [RT] The high numbers are primarily driven by new lesion development rather than growth of existing tumors confirming the presence of significant disease activity in RESTORE patients [RT] Suppression of disease activity with Onculitis is lower than expected, as much stronger radiographic effects were observed with Onculitis in CLARITY [RT]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 11,
            "chunk_length": 1102,
            "num_words": 165
        }
    },
    {
        "content": "Advisors debated whether competing medications have stronger effects on disease activity than Onculitis based on the RESTORE radiographic results One advisor stated that greater effects on disease activity was observed with Drug X and Drug Y in their respective clinical studies [JS], whereas another advisor [RT] pointed out that these drugs have not been studied in the early-stage population and also that Drug Y failed to significantly reduce metastatic spread in the CONFIRM study\n\nSuperior effects on disease activity have been observed with conventional chemotherapy in the SUMMIT study and with radiation therapy in the CASCADE study [RT]\n\nChange in tumor volume is not a sensitive outcome measure [SC] A tumor can shrink in size and a new lesion can develop over time; both these changes can impact tumor volume data [SC] Rather than tumor volume, the number of new lesions is a more reliable outcome [SC] Numbers of new lesions correlate with survival and quality of life over 4 years, whereas no such correlation has been seen with tumor volume [RT; unpublished observations from an ongoing study]\n\nSubgroup Analysis",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 12,
            "chunk_length": 1127,
            "num_words": 180
        }
    },
    {
        "content": "The subgroup analyses results in RESTORE are very informative and align with similar data reported for VISION and CLARITY Support that Onculitis is well suited for patients with more severe and advanced disease [RT] A limitation of these analyses is the lack of information on ethnic subgroups [CT] With the majority of patients being Caucasian, differential effects of Onculitis on African Americans versus the Caucasian patient population cannot be elucidated based on the available analyses\n\nVII. Onculitis Efficacy in Patients With Advanced Disease (Phase 2, VISION, and CLARITY)\n\nOnculitis Usage-Observations by Advisors\n\nOlder patients (>65 years of age) who are not suitable for aggressive chemotherapy may be an ideal patient group for Onculitis treatment [WK] Onculitis should be considered for patients with a more aggressive form of disease [ER] One advisor noted positive experience of switching a patient from conventional therapy to Onculitis [MC]\n\nOnculitis is more appropriate for newly diagnosed patients; it may not be considered for patients with treatment-refractory disease [RT] Careful consideration must be given for prescribing Onculitis for patients with pre-existing neuropathy [JW] The potential for neuropathy is a factor in withholding Onculitis for elderly patients [ER] Unlike Drugs X and Y, Onculitis does not get eliminated from the system within a short period of time by itself [JS]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 13,
            "chunk_length": 1417,
            "num_words": 213
        }
    },
    {
        "content": "Onculitis may be more suitable for the patient who has good baseline neurological function [JW] However, one advisor strongly opined that a patient with mild neuropathy must not be excluded from being treated with Onculitis [MC] Although the Onculitis dose reduction protocol may not be pleasant for some patients, it is important to emphasize the option of managing toxicity through dose modifications, if necessary [JS] One patient from the Onculitis registry experienced complete resolution of neuropathy after dose reduction [MC]\n\nA monitoring program, similar to that of Drug Z, was suggested for Onculitis [JS]\n\nRadiographic Disease Activity",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 14,
            "chunk_length": 647,
            "num_words": 97
        }
    },
    {
        "content": "Radiographic results of phase 2 study substantiate that Onculitis treatment reduces new lesion activity within 6 weeks [SC] The CLARITY data show that the radiographic findings are more encouraging than those of RESTORE; this difference can be attributed to the patient population with more severe disease in CLARITY [RT] Advisors discussed early change in disease burden being a prognostic indicator of long-term survival The 0- to 6-month change in tumor burden always needs to be collected, as this is one of the best predictors of survival in 10 years. Calling this \"pseudoregression\" is not correct. The 6- to 24-month change collection, which is becoming routine practice, is not going to hold out [RT] Consistent evidence that the change in tumor burden from 0 to 6 months predicts survival needs to be seen. Significant change in 6 months in some patients represents a very aggressive disease process that may be resistant to any treatment [SC] At the recent oncology conference, Dr. Lewis presented Drug X data in which, although percentage reduction was significantly high, the absolute tumor burden change was small (0.004) It was noted that the radiographic data (tumor burden) of both CLARITY and RESTORE are being reanalyzed [RT]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 15,
            "chunk_length": 1243,
            "num_words": 199
        }
    },
    {
        "content": "Recently published data in early-stage patients showed that change in metastatic burden in the first 6 months was the best predictor of survival over a 4-year time period [RT] It was queried whether the changes in disease burden are a surrogate for other degenerative mechanisms occurring in the body as a result of aging [SC]\n\nUse of circulating tumor DNA as a biomarker for disease progression was discussed\n\nEfficacy – General Feedback\n\nPost-marketing experience with Onculitis has surpassed efficacy expectations based on clinical trial results (response rate ~30%) [WK] NovelOncology Medical wanted to know from the advisors their opinions regarding that although Onculitis has strong quality of life data, there is a general perception of the drug being less efficacious than other targeted agents in the market based on its response data Traditional assessment scales lack functional components and have poor sensitivity; patient- reported outcome measures should be presented along with traditional metrics to build more confidence in the quality of life data [WK, ER] The fact that Onculitis is the only targeted therapy that has consistent survival data in 2 separate studies is a very powerful message [ER]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 16,
            "chunk_length": 1217,
            "num_words": 189
        }
    },
    {
        "content": "One advisor remarked that NovelOncology should not have terminated the phase 3 combination study (COMBINE) [RT] The phase 2 combination data looked encouraging, and although reimbursement for a combination therapy may have been difficult, the results of the completed study would have attracted a lot of attention\n\nSafety\n\nAs more information and data become available from the long-term use of Onculitis, clinicians become more aware of the associated adverse events [TG] Most advisors agreed that Onculitis is well tolerated by patients Fatigue and neuropathy were noted as the 2 primary reasons for treatment discontinuation [RT, JW] Fatigue has been reported in approximately 30% of patients and resulted in treatment discontinuation in 2 patients [RT] One patient discontinued Onculitis treatment due to severe neuropathy, but did not experience any other serious adverse event in the past 6 months [JW]\n\nHair loss has not emerged as a major concern with Onculitis Mild hair thinning was observed in 1 patient [MC]; however, hair thinning has not led to any treatment discontinuation [ER] Hair thinning is also experienced with Drug X therapy [MC] Detailed information about the risk of hair thinning should be included in patient communications [TG]\n\nNovelOncology Medical clarified that the poster with hair-thinning data will be made available to all health care providers by the MSLs",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 17,
            "chunk_length": 1392,
            "num_words": 215
        }
    },
    {
        "content": "It was queried whether 400mg is an optimal dose of Onculitis and whether it achieves a complete pathway inhibition [MH] NovelOncology Medical clarified that the dose selection was based on the preclinical studies. Mechanistic differences in achieving a complete pathway inhibition have not been tested between the doses of Onculitis Although higher doses of Onculitis are being considered, there is a potential for higher safety concerns\n\nVIII. Onculitis Extension Data and Post Hoc Analyses\n\nLong-term Extension\n\nOnculitis has strong long-term extension data Although the patient numbers are small, it is encouraging to know that patients do well over 5 years [MC] Phase 2 extension data show that if the drug works for some patients, it works long term [JW] Long-term (10 years) data are needed for patients who had disease stabilization at 3 and 4 years [TG]\n\nLong-term data also aid the clinician in making an informed decision regarding patient selection [ER]\n\nPositive long-term survival data are expected of Onculitis, as is the case with any other therapy since only the patients who did well and continued to stay on treatment are being followed up [MC] NovelOncology should follow-up on patients who dropped out from extension and evaluate radiographic activity outcomes [JW]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 18,
            "chunk_length": 1285,
            "num_words": 202
        }
    },
    {
        "content": "Unlike other diseases in which only some patients have recurrence, advanced cancer is associated with long-term progression; therefore, the long-term efficacy data are extremely important [ER] There is a need for a large scale long-term follow-up study of patients on various treatments; this should include efficacy and safety data [RT]\n\nPost Hoc Analyses\n\nNNT of 6 or the fact that 6 people have to be treated to avoid 1 progression event is not as impressive as one might think [JS] NNT data show that most drugs are more similar than different. Therefore, the differences in MoA are important in distinguishing each therapy from another [JW]\n\nWhen presenting NNT data for Onculitis, include similar data for the conventional agents along with other newer therapies [RT] NNT data for radiographic response need to be collected [MC] Generating NNT data using response criteria is helpful [RT]\n\nBiomarkers for treatment response with Onculitis need to be determined [JW, CT]\n\nIX. Complete Response: Concepts and Relationship to Onculitis\n\nHalting the progression of 3 markers that comprise CR—radiographic evidence, survival, and quality of life—is an effective treatment plan [JW] CR is a valid metric for all therapies and must be discussed with the patient [MC] CR should be a treatment goal and must be instituted in newly diagnosed patients [MH] Achieving CR early on should be the treatment goal [WK]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 19,
            "chunk_length": 1407,
            "num_words": 224
        }
    },
    {
        "content": "CR as an outcome measure is beneficial, as it forces clinicians to look for complete disease clearance [ER] However, safety is a key concern for patients, which is not a factor in CR [ER]\n\nAlthough good to practice short-term, evidence in support of CR as a predictive measure is lacking [MC] There is considerable ambiguity regarding the impact of this metric on treatment decisions and its long-term prognostic value [JW] However, the TRIUMPH study and long-term analysis of the AFFINITY study showed some predictability; the AFFINITY long-term study showed that those who met CR in the first 2 years had better long-term outcomes\n\nEvaluation of CR in a 7-year longitudinal oncology cohort showed that the long-term predictive value of CR was not high A limitation was the lack of data from newer targeted therapies\n\nLimitations to CR as a metric: Lack of quality of life, cognition, and patient-related outcome measures in the assessment of CR \"Sustained disease control with preserved functional status\" is a more realistic treatment goal for some patients Inclusion of minimal residual disease in CR is confounded by lack of standardized detection methods For example, a patient with microscopic disease on highly sensitive ctDNA testing may have a considerably greater tumor burden than a patient with no detectable disease on\n\nstandard imaging [RT]\n\nThe probability of CR being a prognostic factor 5-10 years post-treatment [SC] The effect of aging on CR needs to be evaluated [SC]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 20,
            "chunk_length": 1488,
            "num_words": 239
        }
    },
    {
        "content": "The degree of response varies from patient to patient, thus impacting CR [MC] CR may not be a realistic long-term goal as more oncology therapies become available, leading to more frequent treatment switches [RT] Patient may not remain on a specific drug for a prolonged period of time [RT]\n\nIn the AFFINITY study, a 5-fold improvement was observed with Drug Z versus placebo [MC] However, the CR value for the placebo group was not 0 and that for the Drug Z group was 37%; this suggests that some patients may achieve CR without any active treatment, which may be attributable to the natural course of some cancers [ER] These data show the dissociation between the clinical and real-world observations, as most patients do much better on Drug Z than demonstrated by the AFFINITY results [JS] The low difference in the CR values between Drug Z and placebo can be attributed to the following [RT]: Lower sensitivity of scans conducted on older machines Variations in analysis techniques\n\nIt was further clarified that the Year 1-2 data of Drug Z in AFFINITY are much superior to Year 0-1, as the effect of Drug Z is not evident until 2-3 months after treatment [ER]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 21,
            "chunk_length": 1164,
            "num_words": 201
        }
    },
    {
        "content": "It was recommended that NovelOncology do a prospective analysis on real-world patients receiving Onculitis treatment, as this population will be different from those enrolled in the clinical trials [RT] Expectations from CR vary from drug to drug; there is a need to assess Onculitis's position in the treatment algorithm that will help patients achieve CR [MC]\n\nX. Workshop: Complete Response in Clinical Practice (2 Case Scenarios)\n\nCase Scenario 1\n\nPatient with 1 clinical progression but no radiographic activity in the last year who is also experiencing treatment fatigue and would like to switch to a targeted therapy\n\nClinical Considerations\n\nIn general, treatments should be individualized on a case-by-case basis; there are no universal guidelines applicable to all cancer patients [JS] Patient's disease should be treated as aggressively as possible [SC] The clinical situation of the patient primarily drives treatment decisions [TG]\n\nCR is a feasible metric in this patient [WK] The lack of radiographic activity is indicative of good prognosis, but disease activity may occur if the same treatment is continued; the patient may benefit from a switch in treatments [WK]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 22,
            "chunk_length": 1181,
            "num_words": 181
        }
    },
    {
        "content": "Prognostic factors that will impact clinical decisions in this patient include [WK] Type of disease progression (symptomatic vs asymptomatic) Patient demographics including age, gender, comorbidities, and race Length of time since diagnosis, and treatment duration Patient preference Biomarkers: levels should be monitored regularly Level of functional impairment: A high functional status indicates that the patient needs to be treated aggressively [JS] However, the difference between moderate and mild impairment is not very meaningful and will not impact clinical decisions [MC]\n\nTreatment switch decisions are determined by the following: Adverse events of a treatment [WK] Patient's threshold for tolerability [WK]\n\nCase Scenario 2\n\nPatient who is clinically stable on current therapy who experienced 1 new lesion in the last 6 months Additional patient characteristics: 45 years of age and been on current therapy for 5 years\n\nClinical Considerations Treatment Individual patient profile must be strongly considered For example, an African American patient with aggressive disease will be treated more intensively [MC] It is important for patients to believe in the treatment they are receiving, as it gets harder to switch as time progresses [SC]\n\nAge, insurance, and employment status need to be considered [SC]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 23,
            "chunk_length": 1320,
            "num_words": 193
        }
    },
    {
        "content": "One advisor shared a similar anecdotal experience of a patient (early 40s) on Drug X who experienced 1 new lesion after 2 years of treatment and preferred to continue treatment rather than switching [JS] The importance of compliance must be underscored to the patient [SC]\n\nThere are many factors that influence treatment switch decisions Lesion attributes including size [JD] and location (brain vs bone metastases) [WK] It is important to note that approximately 60% of new lesions do not lead to symptom development or require local therapy [MC] In an ongoing study, the clinical relevance of new lesions after treatment is being evaluated. Although it is known that these lesions may respond to local therapy, the impact on overall disease control may be permanent [RT]\n\nPatient will be switched from one treatment to another if there are tolerance issues [ER] Patient will be switched to Drug Z if the patient has 1 new lesion and disease progression on treatment [ER]\n\nFunctional status A small decline in functional capacity may not warrant a treatment switch for a patient with severe impairment [MH] Patient-reported outcomes may provide additional information that is not captured by traditional assessment tools [ER]",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 24,
            "chunk_length": 1227,
            "num_words": 196
        }
    },
    {
        "content": "Diagnosis Comprehensive staging is mostly used for diagnosis [WK] Initially, response by RECIST criteria is evaluated; more aggressive forms of disease warrant additional assessments [TG] In clinical practice, time is a constraint; therefore, conducting both imaging and functional assessments at every visit is not feasible. Lesion assessments are more impactful since they can be visualized and measured [RT]\n\nAlthough cancer outcomes vary widely, all decisions should focus on extending both quantity and quality of life [SC] Changes in functional status, pain levels, and quality of life need to be routinely assessed [SC]\n\nXI. Follow-up and Recommendations\n\n|  |\n|---|\n|  |",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_chunk",
            "chunk_index": 25,
            "chunk_length": 678,
            "num_words": 101
        }
    },
    {
        "content": "| ADVISOR FEEDBACK | FOLLOW-UP ACTION |\n|---|---|\n| Onculitis MoA |  |\n| - Specific mechanisms that further elucidate the MoA and detail the\npreservation of normal cellular processes and functions of Onculitis must\nbe investigated<br><br>- The magnitude of the effect of Onculitis on\nPRKL7-expressing cells<br> - Proportion of high versus low expressing\ncells affected by Onculitis<br><br>- Dose required to achieve full pathway\ninhibition; potential for dose adjustments<br><br>- The time frame of\nwhen resistance develops after continuous use of the drug<br><br>-\nInformation clearly differentiating targeted therapy and conventional\ntreatment mechanisms for patients is required | - All 5 recommendations will be\nforwarded to the Medical Affairs\nand Research and Development\nteams |\n| Onculitis Efficacy |  |\n| - Radiographic activity in patients who discontinued the clinical study<br>\n<br>- When presenting NNT data for Onculitis, include similar data for the\nconventional agents along with other newer therapies<br><br>- NNT data\nfor radiographic response needs to be presented | - Recommendations (first 2) will\nbe forwarded to the Medical\nAffairs and Commercial\nteams<br><br>-\nRecommendation will be\nforwarded to the Medical Affairs\nand Research and Development\nteams |\n| Additional Studies and Educational Needs |  |\n| - Mechanism of neuropathy development/resolution needs to be\ncommunicated<br><br>- Real-world patient outcomes including effect of\ntreatment on quality of life, functional",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_sub_chunk_from_table",
            "chunk_index": 26,
            "chunk_length": 1499,
            "num_words": 216,
            "original_page_num_of_element": 17,
            "original_element_type": "table"
        }
    },
    {
        "content": "nd Educational Needs |  |\n| - Mechanism of neuropathy development/resolution needs to be\ncommunicated<br><br>- Real-world patient outcomes including effect of\ntreatment on quality of life, functional status, and activities of daily living\nneed to be captured | - Both recommendations will be\nforwarded to the Medical Affairs\nand Research and Development\nteams |",
        "metadata": {
            "file_name": "Onculitis Efficacy Advisory Board - Executive Summary.pdf",
            "file_type": "pdf",
            "file_size": 671097,
            "chunk_type": "pdf_sub_chunk_from_table",
            "chunk_index": 27,
            "chunk_length": 361,
            "num_words": 54,
            "original_page_num_of_element": 17,
            "original_element_type": "table"
        }
    },
    {
        "content": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board\n\nThe Grand Hyatt Hotel, Boston, MA\n\nSaturday, March 18, 2025\n\nPost-Meeting Report\n\nTable of Contents\n\nI. Participants..........................................................................................2\n\nII. Agenda.................................................................................................3\n\nIII. Objectives...........................................................................................4\n\nIV. Top-line Summary..............................................................................5\n\nOnculitis Real-World Data Collection Framework.............................5 Long-Term Safety Monitoring Strategies.........................................6 Patient-Reported Outcomes and Quality of Life Measures..............6 Expanded Indications and Regulatory Considerations....................7\n\nV. Onculitis Real-World Data Collection Framework...............................8\n\nRWD Collection — General Feedback.............................................8 Data Integration Challenges.........................................................10 Additional Studies and Evidence Needs.......................................11\n\nVI. Long-Term Safety Monitoring Strategies.........................................12",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 0,
            "chunk_length": 1323,
            "num_words": 78
        }
    },
    {
        "content": "Safety Profile Across Patient Subgroups......................................12 Pharmacovigilance Program Enhancements................................13 Risk Mitigation Strategies...........................................................14\n\nVII. Patient-Reported Outcomes and Quality of Life Measures..............15\n\nPRO Implementation in Clinical Practice......................................15 Digital Health Solutions for PRO Collection..................................16 Correlation Between PROs and Clinical Outcomes......................17\n\nVIII. Expanded Indications Considerations............................................18\n\nPotential New Indications...........................................................18 Regulatory Pathway Strategies....................................................19 Reimbursement and Access Implications....................................20\n\nIX. Workshop: Real-World Evidence Implementation............................21\n\nCase Scenario 1: Community-Based Oncology Setting.................21 Clinical Considerations................................................................22 Case Scenario 2: Academic Medical Center Setting.....................23 Clinical Considerations................................................................24\n\nX. Follow-up and Recommendations.....................................................25\n\nI. Participants",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 1,
            "chunk_length": 1394,
            "num_words": 78
        }
    },
    {
        "content": "| [Chair] |  |\n|---|---|\n| Elizabeth Chen, MD, PhD [EC] |  |\n| Memorial Sloan Kettering Cancer Center |  |\n| New York, NY |  |\n\n|  |\n|---|\n|  |\n\n| [Advisors]\nMarcus Washington, MD [MW] Sophia Patel, MD, PhD [SP]\nDana-Farber Cancer Institute Mayo Clinic\nBoston, MA Rochester, MN\nDavid Ramirez, DO [DR] Jennifer Tran, MD [JT]\nMD Anderson Cancer Center Northwestern University\nHouston, TX Chicago, IL\nMichael Chen, MD [MC] Natalie Brooks, MD [NB]\nStanford University Medical Center University of California, San Francisco\nPalo Alto, CA San Francisco, CA\nRobert Kim, MD, PhD [RK] Sarah Wilson, PharmD [SW]\nVanderbilt-Ingram Cancer Center Fred Hutchinson Cancer Center\nNashville, TN Seattle, WA\nThomas Lee, MD [TL] Lisa Johnson, MD [LJ]\nOneOncology Duke Cancer Institute\nAtlanta, GA Durham, NC\nCarlos Rodriguez, MD, PhD [CR]\nUniversity of Miami Sylvester\nComprehensive Cancer Center\nMiami, FL |\n|---|\n|  |\n| [Pharmaxis]\nKaren Wong [KW] James Miller, MD [JM]\nAssociate Director, Oncology HEOR Director of Medical Affairs\nSan Francisco, CA San Francisco, CA\nOlivia Taylor, PhD [OT] Daniel Park [DP]\nMedical Director Senior Manager, Medical Strategy\nSan Francisco, CA San Francisco, CA\nMegan Richards, PhD [MR]\nMedical Science Liaison\nSan Francisco, CA |",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 2,
            "chunk_length": 1246,
            "num_words": 200
        }
    },
    {
        "content": "| [Advisors] |  |\n|---|---|\n| Marcus Washington, MD [MW] | Sophia Patel, MD, PhD [SP] |\n| Dana-Farber Cancer Institute | Mayo Clinic |\n| Boston, MA | Rochester, MN |\n| David Ramirez, DO [DR] | Jennifer Tran, MD [JT] |\n| MD Anderson Cancer Center | Northwestern University |\n| Houston, TX | Chicago, IL |\n| Michael Chen, MD [MC] | Natalie Brooks, MD [NB] |\n| Stanford University Medical Center | University of California, San Francisco |\n| Palo Alto, CA | San Francisco, CA |\n| Robert Kim, MD, PhD [RK] | Sarah Wilson, PharmD [SW] |\n| Vanderbilt-Ingram Cancer Center | Fred Hutchinson Cancer Center |\n| Nashville, TN | Seattle, WA |\n| Thomas Lee, MD [TL] | Lisa Johnson, MD [LJ] |\n| OneOncology | Duke Cancer Institute |\n| Atlanta, GA | Durham, NC |\n| Carlos Rodriguez, MD, PhD [CR] |  |\n| University of Miami Sylvester |  |\n| Comprehensive Cancer Center |  |\n| Miami, FL |  |\n\n|  |  |\n|---|---|\n| [Pharmaxis] |  |\n| Karen Wong [KW] | James Miller, MD [JM] |\n| Associate Director, Oncology HEOR | Director of Medical Affairs |\n| San Francisco, CA | San Francisco, CA |\n| Olivia Taylor, PhD [OT] | Daniel Park [DP] |\n| Medical Director | Senior Manager, Medical Strategy |\n| San Francisco, CA | San Francisco, CA |\n| Megan Richards, PhD [MR] |  |\n| Medical Science Liaison |  |\n| San Francisco, CA |  |\n\n|  |\n|---|\n|  |",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 3,
            "chunk_length": 1317,
            "num_words": 261
        }
    },
    {
        "content": "| [MediScribe Group] |  |\n|---|---|\n| Andrew Martinez | Rebecca Johnson, PhD |\n| MediScribe Group | MediScribe Group |\n| Chicago, IL | Chicago, IL |\n| Samantha Lee, PhD |  |\n| MediScribe Group |  |\n| Chicago, IL |  |\n\nII. Agenda\n\nSaturday, March 18\n\n7:00 AM Breakfast\n\n7:45 AM Welcome, Introductions and Meeting Objectives Chairperson: Elizabeth Chen, MD, PhD\n\n8:00 AM Onculitis Real-World Data Collection Framework (25-min presentation/35-min discussion) Presenter: Michael Chen, MD\n\n9:00 AM Long-Term Safety Monitoring Strategies (25-min presentation/35-min discussion) Presenter: Sophia Patel, MD, PhD\n\n10:00 AM Break (15 min)\n\n10:15 AM Patient-Reported Outcomes and Quality of Life Measures (25-min presentation/35-min discussion) Presenter: Jennifer Tran, MD\n\n11:15 AM Expanded Indications and Regulatory Considerations (25-min presentation/35-min discussion) Presenter: Robert Kim, MD, PhD\n\n12:15 PM Lunch (ongoing discussion)\n\n1:15 PM Workshop: Real-World Evidence Implementation (60-min discussion) Moderators: James Miller, MD, and Olivia Taylor, PhD\n\n2:15 PM Workshop Recap and Integration Strategy (45-min discussion) Moderator: Elizabeth Chen, MD, PhD\n\n3:00 PM Break (15 min)\n\n3:15 PM Action Plan Development and Timeline (30-min discussion) Moderator: Karen Wong\n\n3:45 PM Final Comments, Sponsor and Chair Summaries\n\n4:00 PM Adjourn\n\nIII. Objectives",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 4,
            "chunk_length": 1362,
            "num_words": 193
        }
    },
    {
        "content": "Obtain expert feedback on: Proposed frameworks for collecting real-world evidence (RWE) on Onculitis safety and effectiveness across diverse practice settings Strategies for long-term safety monitoring and risk minimization approaches for patients on Onculitis therapy Methods for capturing and analyzing patient-reported outcomes (PROs) to comprehensively assess Onculitis' impact on quality of life Evidence requirements to support potential expanded indications for Onculitis in additional tumor types Implementation strategies for integrating RWE collection into routine clinical practice with minimal burden\n\nIV. Top-line Summary\n\nOnculitis Real-World Data Collection Framework\n\nIt is essential to establish a standardized data collection framework that can be implemented across diverse healthcare settings, from community practices to academic medical centers A tiered approach to data collection was recommended, with core elements required from all sites and supplemental data collected at centers with greater capacity\n\nAdvisors strongly endorsed the development of a cloud-based platform that integrates with electronic health records (EHRs) to facilitate seamless data collection This solution must address interoperability challenges and incorporate appropriate data\n\nprivacy safeguards",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 5,
            "chunk_length": 1299,
            "num_words": 167
        }
    },
    {
        "content": "Patient selection for the real-world evidence program should be representative of the broader patient population treated with Onculitis Special attention should be given to including traditionally underrepresented groups, including elderly patients, those with significant comorbidities, and diverse ethnic backgrounds\n\nThe real-world data collection should focus on the following key elements: Treatment patterns and sequencing Dosing modifications in clinical practice Management of adverse events Predictive biomarkers of response and resistance Long-term outcomes beyond traditional clinical trial endpoints\n\nLong-Term Safety Monitoring Strategies\n\nA comprehensive pharmacovigilance plan specific to Onculitis should be developed with input from treating physicians and patient advocacy groups The current safety profile is favorable, but additional monitoring is needed for rare events that may emerge with broader use\n\nSpecial attention should be paid to potential late-onset adverse events that may not have been captured in clinical trials, particularly: Immune-related adverse events in patients with autoimmune comorbidities Potential sequelae from cumulative exposure in long-term responders Interactions with subsequent therapies in treatment sequencing\n\nRisk minimization strategies should be practical and not overly burdensome for healthcare providers Provider education and patient monitoring tools should be electronically integrated into standard workflows where possible",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 6,
            "chunk_length": 1489,
            "num_words": 190
        }
    },
    {
        "content": "Establishment of an independent safety review committee was recommended to periodically assess emerging safety signals from real-world use\n\nPatient-Reported Outcomes and Quality of Life Measures\n\nValidated PRO instruments specific to Onculitis therapy should be developed to capture the nuanced impact on quality of life These instruments should be concise, digitally accessible, and available in multiple languages\n\nDigital health technologies, including smartphone applications and wearable devices, can enhance the collection of PRO data between clinic visits However, these solutions must be accessible to all patient populations, including those with limited technological literacy\n\nIntegration of PRO data with clinical outcomes will provide a more comprehensive understanding of the benefit-risk profile of Onculitis Correlation between symptom burden, functional status, and survival outcomes should be systematically analyzed\n\nPatient-reported data should inform shared decision-making and potentially guide dose modifications or supportive care interventions\n\nExpanded Indications and Regulatory Considerations\n\nPromising preliminary data support investigation of Onculitis in additional tumor types beyond Melanocarcinoma, particularly: Advanced gastrointestinal stromal tumors (GIST) Selected subtypes of sarcoma Refractory thyroid cancers Certain hematologic malignancies with solid tumor involvement",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 7,
            "chunk_length": 1413,
            "num_words": 176
        }
    },
    {
        "content": "A strategic approach to expanded indication efforts should prioritize tumor types based on: Biological rationale and mechanistic fit Unmet medical need Competitive landscape Regulatory feasibility\n\nRegulatory pathways for expanded indications should leverage both traditional clinical trials and RWE approaches Design of basket or umbrella trials guided by biomarker strategies was strongly recommended\n\nReimbursement considerations should be addressed early in the development of expanded indication strategies Payer advisory boards and early health economic analyses were suggested as critical components\n\nV. Onculitis Real-World Data Collection Framework\n\nRWD Collection — General Feedback\n\nReal-world data (RWD) collection for Onculitis must be strategically designed to provide meaningful insights while minimizing burden on healthcare providers and patients [MC, SP] \"The ideal RWD framework balances scientific rigor with practical implementation constraints. Over-engineering the system will result in poor adoption and incomplete data.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 8,
            "chunk_length": 1050,
            "num_words": 136
        }
    },
    {
        "content": "Advisors strongly recommended focusing on a core set of critical variables that can be consistently collected across all practice settings [EC, TL, NB] Core elements should include: baseline patient characteristics, dosing information, treatment duration, response assessment, adverse events, and reason for discontinuation [EC] \"Community practices often lack research infrastructure, so the minimal dataset must be truly minimal—focus on what matters most.\" [TL]\n\nA tiered approach to data collection was widely endorsed [general consensus] Tier 1: Basic clinical data feasible for all settings Tier 2: Expanded clinical data, including more detailed safety information and treatment patterns Tier 3: Advanced data elements, including biospecimens, PROs, and detailed quality of life measures \"This stratified approach allows us to gather some data from everyone and comprehensive data from capable centers, rather than getting incomplete data across the board.\" [NB]\n\nTechnology infrastructure is critical for successful RWD collection [RK, CR, LJ] EHR integration capabilities were identified as essential, with advisors noting significant challenges with current interoperability limitations [RK] \"Without automated data extraction, this will create an unsustainable documentation burden. Manual chart abstraction is error-prone and resource-intensive.\" [LJ] Mobile applications for direct patient reporting should complement provider-reported data [CR]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 9,
            "chunk_length": 1458,
            "num_words": 193
        }
    },
    {
        "content": "Patient selection for RWD collection should reflect the diversity of the real-world treatment population [DR, JT, SP] Advisors emphasized the importance of including patients typically excluded from clinical trials, such as those with: [DR] ECOG performance status >2 Brain metastases Autoimmune conditions Significant organ dysfunction Prior malignancies\n\n\"Our clinical trial populations are highly curated. The real value of RWE is understanding outcomes in patients who wouldn't qualify for trials.\" [JT] Special emphasis was placed on capturing data from elderly patients and those from diverse ethnic backgrounds, who are traditionally underrepresented in clinical trials [SP]\n\nLongitudinal follow-up duration should be extended beyond conventional clinical trial endpoints [MW, SW] \"With novel therapies like Onculitis, we're seeing patients living longer than ever. Our follow-up needs to extend accordingly to capture late effects and long-term outcomes.\" [MW] At minimum, 5-year follow-up was recommended for all patients, with a subset followed for 10+ years [SW]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 10,
            "chunk_length": 1073,
            "num_words": 150
        }
    },
    {
        "content": "Standardization of outcome definitions across sites is essential [general consensus] Response criteria should align with established guidelines (RECIST v1.1) while acknowledging potential limitations for certain response patterns [MC] Progression-free survival, time to next treatment, and overall survival were identified as critical outcome measures [EC] Treatment-free intervals and maintenance of quality of life during these intervals should be captured [SP]\n\nData Integration Challenges\n\nEHR system heterogeneity presents significant challenges for RWD collection [general consensus] Advisors noted wide variation in EHR capabilities across practice settings, with some systems offering robust integration capabilities while others provide minimal support [TL] \"The reality is that many community practices are still using legacy EHR systems with limited functionality. Any solution needs to accommodate this reality.\" [TL]\n\nNatural language processing (NLP) was discussed as a potential solution for extracting data from unstructured clinical notes [MC, RK] While promising, advisors cautioned that NLP accuracy varies significantly across contexts and requires validation [RK] \"We've tried this at our center with mixed results. It works well for certain structured elements but struggles with nuanced clinical assessments.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 11,
            "chunk_length": 1337,
            "num_words": 177
        }
    },
    {
        "content": "Data privacy and regulatory compliance requirements add complexity [CR, LJ] HIPAA compliance is non-negotiable, but implementation approaches vary across institutions [CR]\n\nInstitutional Review Board (IRB) requirements differ, potentially creating administrative barriers to multi-site data collection [LJ] \"Each institution has their own interpretation of data sharing regulations. Creating a harmonized approach requires early engagement with compliance teams.\" [CR]\n\nIntegration of genomic and biomarker data presents unique challenges [SP, MW] Testing methodologies and platforms vary significantly across centers [SP] Standardization of biomarker reporting is essential for meaningful analysis [MW] \"Without standardized biomarker definitions and cutoffs, we'll end up with fragmented data that can't be properly aggregated or analyzed.\" [SP]\n\nResource constraints at smaller practices may limit participation [TL, DR] Community oncology practices often lack dedicated research staff and infrastructure [TL] Financial support or incentives may be necessary to ensure broad participation [DR] \"The economic reality is that many practices are operating on thin margins. Additional documentation without compensation isn't sustainable.\" [TL]\n\nAdditional Studies and Evidence Needs",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 12,
            "chunk_length": 1282,
            "num_words": 164
        }
    },
    {
        "content": "Comparative effectiveness studies comparing Onculitis to standard of care treatments were identified as a high priority [EC, MW, NB] Propensity score matching or similar methodologies will be necessary to account for inherent biases in treatment selection [EC] \"Understanding how Onculitis performs against current standards of care in real-world settings is crucial for clinical decision-making and reimbursement decisions.\" [MW]\n\nStudies examining the impact of dose modifications on outcomes are needed [SP, SW, DR] Clinical experience suggests that some patients may require dose adjustments that differ from label recommendations [SP] \"In the real world, we often modify doses based on tolerability. Understanding the impact of these modifications on efficacy is essential for optimizing therapy.\" [SW]\n\nTreatment sequencing studies to identify optimal positioning of Onculitis in the treatment paradigm [JT, MC, RK] Data on outcomes when Onculitis is used in various lines of therapy would inform clinical practice [JT] Impact of prior therapies on Onculitis efficacy and safety profile needs investigation [MC] \"The sequencing question is critical—does prior immunotherapy affect response to Onculitis? Does Onculitis affect response to subsequent therapies? These are crucial clinical questions.\"\n\n[RK]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 13,
            "chunk_length": 1310,
            "num_words": 183
        }
    },
    {
        "content": "Predictive biomarkers beyond those studied in registration trials [NB, CR, MW] Novel biomarkers that predict response or resistance should be explored [NB] \"Trial-validated biomarkers are just the starting point. Real-world data will likely reveal additional predictive factors that couldn't be identified in smaller controlled studies.\" [CR]\n\nHealth economics and outcomes research (HEOR) studies [SW, LJ] Impact of Onculitis on healthcare resource utilization compared to alternative therapies [SW] Cost-effectiveness analyses across different patient subgroups and treatment settings [LJ] \"Demonstrating economic value alongside clinical benefit will be critical for ensuring access and reimbursement.\" [SW]\n\nSpecial population studies [DR, JT, TL] Outcomes in elderly patients (>75 years) [DR] Safety and efficacy in patients with organ dysfunction [JT] Use in rare tumor subtypes or unusual presentations [TL] \"These special populations represent significant knowledge gaps that are unlikely to be addressed in traditional clinical trials.\" [DR]\n\nVI. Long-Term Safety Monitoring Strategies\n\nSafety Profile Across Patient Subgroups",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 14,
            "chunk_length": 1135,
            "num_words": 151
        }
    },
    {
        "content": "Current safety data from clinical trials provide a foundation, but real-world monitoring is essential to characterize the safety profile in broader populations [SP, NB] \"Clinical trials are designed for clean safety signals in relatively healthy patients. The real-world introduces comorbidities, comedications, and compliance issues that complicate the safety picture.\" [SP]\n\nAdvisors identified specific patient subgroups requiring enhanced safety monitoring [general consensus] Patients with autoimmune conditions who were excluded from clinical trials [DR, JT] Elderly patients, particularly those with reduced organ function [MW, TL] Patients with significant hepatic or renal impairment [SW, NB] Those receiving concomitant medications with potential interactions [MC, LJ] \"Patients with controlled autoimmune conditions represent a substantial portion of our practice but were systematically excluded from trials. Their risk profile may differ significantly.\" [DR]\n\nLong-term immune-related adverse events (irAEs) were highlighted as a particular concern [SP, RK, JT] Potential for delayed-onset irAEs months or years after treatment initiation [SP] Cumulative risk with prolonged exposure in long-term responders [RK] \"With other immunomodulatory agents, we've seen irAEs emerge years after treatment. We need vigilance beyond the typical monitoring period.\" [JT]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 15,
            "chunk_length": 1371,
            "num_words": 180
        }
    },
    {
        "content": "Cardiovascular safety monitoring was identified as a priority [NB, CR, TL] Signal from registration trials was not definitive but suggested potential vascular effects [NB] Risk may be heightened in patients with pre-existing cardiovascular disease [CR] \"The cardiovascular signal wasn't statistically significant but seems biologically plausible given the mechanism. We should proactively monitor this in real-world use.\" [TL]\n\nEndocrinopathy risk requires standardized monitoring [DR, SP] Baseline and periodic thyroid function testing was recommended [SP] Guidelines for management of treatment-related endocrinopathies should be developed [DR] \"The endocrine effects appear manageable but require consistent monitoring and early intervention.\" [SP]\n\nAdaptive monitoring strategy based on emerging safety data was suggested [MW, RK, EC] Initial intensive monitoring with potential relaxation as safety profile is better understood [MW] \"Our monitoring approach should evolve as we gather more data—starting conservatively and adjusting based on real-world experience.\" [EC]\n\nPharmacovigilance Program Enhancements",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 16,
            "chunk_length": 1115,
            "num_words": 143
        }
    },
    {
        "content": "Integration of passive and active surveillance methods was recommended [general consensus] Spontaneous reporting system enhancements to improve data quality [SP] Targeted questionnaires for specific adverse events of interest [CR] Sentinel site network for enhanced monitoring and detailed case investigations [MW] \"A multi-modal approach combining different surveillance methodologies will provide the most comprehensive safety picture.\" [SP]\n\nEstablishment of an independent safety monitoring committee [EC, NB, JT] Regular review of emerging safety data with ability to recommend program modifications [EC] Composition should include oncologists, pharmacovigilance experts, and patient representatives [NB]\n\n\"An independent committee provides critical oversight and helps maintain objectivity in safety signal interpretation.\" [JT]\n\nPatient registry specific to Onculitis therapy [RK, TL, SW] Dedicated registry focused on long-term outcomes and safety [RK] Integration with existing cancer registries where possible [TL] \"A purpose-built registry can capture nuanced safety information that might be missed in broader data collection efforts.\" [SW]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 17,
            "chunk_length": 1152,
            "num_words": 147
        }
    },
    {
        "content": "Enhanced adverse event reporting tools [MC, DR, LJ] Mobile applications for patient self-reporting of symptoms [MC] Integration of adverse event reporting into EHR workflows [DR] Standardized grading criteria specific to Onculitis-related toxicities [LJ] \"Friction in the reporting process leads to underreporting. We need tools that make adverse event reporting seamless and integrated into normal workflow.\" [DR]\n\nPeriodic benefit-risk assessments [SP, EC, CR] Regular, comprehensive review of the evolving benefit-risk profile [SP] Stratification by patient characteristics and treatment factors [EC] \"As we gather more data, we need systematic processes to reassess the benefit-risk equation for different patient populations.\" [CR]\n\nRisk Mitigation Strategies\n\nDevelopment of comprehensive risk evaluation and mitigation strategy (REMS) [general consensus] Advisors were divided on whether a formal REMS program is necessary [varied opinions] \"A well-designed REMS could ensure appropriate patient selection and monitoring, but must balance safety with access.\" [EC] \"A REMS might be excessive given the current safety profile. Educational tools without the formal REMS structure could be sufficient.\" [TL]\n\nProvider education programs [NB, SW, DR] Targeted education on early recognition and management of Onculitis-specific adverse events [NB] Case-based learning approaches rather than didactic presentations [SW] Regular updates as new safety information emerges [DR]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 18,
            "chunk_length": 1476,
            "num_words": 197
        }
    },
    {
        "content": "\"Education should focus on practical management strategies rather than exhaustive toxicity lists.\" [NB]\n\nPatient education materials [JT, LJ, CR] Clear, accessible information on potential side effects and when to seek medical attention [JT] Available in multiple languages and literacy levels [LJ] Companion materials for caregivers [CR] \"Patient materials need to strike a balance—informative without being alarmist, accessible without being oversimplified.\" [JT]\n\nTreatment guidelines for adverse event management [SP, MC, MW] Algorithm-based approach to common toxicities [SP] Clear guidance on when to hold or discontinue therapy [MC] Recommendations for supportive care interventions [MW] \"Standardized management algorithms improve outcomes and reduce practice variation in toxicity management.\" [SP]\n\nLaboratory monitoring recommendations [RK, SW, DR] Consensus on essential baseline testing [RK] Frequency of monitoring during treatment [SW] Tailored monitoring for high-risk patients [DR] \"Monitoring recommendations need to be evidence-based and feasible in diverse practice settings.\" [SW]\n\nVII. Patient-Reported Outcomes and Quality of Life Measures\n\nPRO Implementation in Clinical Practice",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 19,
            "chunk_length": 1203,
            "num_words": 155
        }
    },
    {
        "content": "Advisors strongly endorsed the integration of PROs into routine clinical assessment for patients receiving Onculitis [general consensus] \"PROs capture dimensions of the treatment experience that clinician assessments miss. They're essential for truly understanding the patient experience with Onculitis.\" [JT]\n\nPractical implementation considerations dominated the discussion [TL, DR, NB] Frequency of assessment must balance comprehensive data collection with patient burden [TL] Workflow integration is critical for sustained implementation [DR]\n\n\"Even the best PRO tool will fail if it creates workflow disruptions or significant time burdens for clinic staff.\" [NB]\n\nSelection of appropriate PRO instruments for Onculitis [JT, SP, MC] Core instruments should include general quality of life (EORTC QLQ-C30) and symptom burden (PRO-CTCAE) measures [JT] Supplemental assessments should address Onculitis-specific symptoms [SP] \"We need a combination of validated general instruments and targeted questions specific to Onculitis toxicities.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 20,
            "chunk_length": 1047,
            "num_words": 137
        }
    },
    {
        "content": "Recommended assessment schedule [general consensus] Baseline assessment prior to treatment initiation [EC] Assessment at each treatment visit for the first 3 months [JT] Monthly assessments thereafter, potentially decreasing to quarterly in stable patients [MW] Assessment at treatment discontinuation and 3 months post-discontinuation [SP] \"The schedule should be more intensive early in treatment when side effects typically emerge, with less frequent assessment once patients stabilize.\" [JT]\n\nPRO data interpretation and clinical application [RK, CR, LJ] Establishment of clinically meaningful change thresholds for each measure [RK] Decision support tools to help clinicians interpret and act on PRO data [CR] \"PRO data collection without clear action plans becomes an academic exercise. We need guidelines for how to respond to concerning PRO signals.\" [LJ]\n\nIntegration with clinical outcomes [EC, MW, SP] Analysis of correlation between PRO trends and clinical outcomes [EC] Potential for PROs as early indicators of disease progression or treatment toxicity [MW] \"There's growing evidence that PROs can detect disease progression before imaging in some contexts. This deserves investigation with Onculitis.\" [SP]\n\nDigital Health Solutions for PRO Collection\n\nElectronic PRO (ePRO) systems were strongly preferred over paper-based collection [general consensus] \"Paper-based collection is obsolete. It creates data entry burden, delays feedback, and complicates analysis.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 21,
            "chunk_length": 1485,
            "num_words": 203
        }
    },
    {
        "content": "Multiple collection modalities should be supported [TL, NB, SW] Web-based platforms accessible via computer, tablet, or smartphone [TL]\n\nIntegration with patient portals where available [NB] Options for patients without digital access, including telephone-based assessment [SW] \"Digital approaches are preferred but must not create disparities for patients with limited technology access or literacy.\" [SW]\n\nRemote monitoring capabilities between clinic visits [JT, RK, DR] Scheduled remote assessments to detect issues between clinic visits [JT] Alert systems for concerning symptoms requiring intervention [RK] \"Remote monitoring represents an opportunity to extend care beyond the clinic and intervene before problems escalate.\" [DR]\n\nIntegration of wearable technology and passive data collection [MC, CR] Activity monitors to objectively assess functional status [MC] Sleep quality assessment as an indicator of well-being [CR] \"Passive monitoring through wearables could complement active PRO reporting and provide objective data on functional status.\" [MC]\n\nChallenges with technology implementation [general consensus] Elderly patients may face particular challenges with digital tools [MW] Socioeconomic disparities in technology access [LJ] Institutional barriers including IT infrastructure limitations [TL] \"We need to ensure our digital solutions work for all patients, not just the technologically sophisticated.\" [MW]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 22,
            "chunk_length": 1432,
            "num_words": 187
        }
    },
    {
        "content": "Data security and privacy considerations [CR, SP, RK] HIPAA compliance requirements [CR] Patient comfort with digital health monitoring [SP] \"Privacy concerns are paramount, especially for cancer patients who may fear employment discrimination or other consequences if their health data is compromised.\" [RK]\n\nCorrelation Between PROs and Clinical Outcomes\n\nEmerging evidence suggests PROs may have prognostic significance [EC, SP, MC] Early PRO changes during Onculitis treatment might predict long-term outcomes [EC] Pattern recognition across multiple PRO domains could reveal important signals [SP] \"There's growing literature suggesting that PRO deterioration often precedes radiographic progression. We should explore this relationship with Onculitis.\" [MC]\n\nQuality of life maintenance as a treatment goal [JT, NB, LJ] Even without survival improvement, maintained quality of life represents a valuable outcome [JT] Trade-offs between efficacy and quality of life should be explicitly discussed with patients [NB] \"For many patients, especially those with advanced disease, quality of life is as important as— or more important than—survival duration.\" [LJ]\n\nPRO data to inform treatment modifications [RK, DR, TL] Potential for PRO-guided dose adjustments to optimize tolerability [RK] Early supportive care interventions triggered by PRO signals [DR] \"Proactive management of symptoms detected through PROs could improve adherence and potentially efficacy.\" [TL]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 23,
            "chunk_length": 1471,
            "num_words": 200
        }
    },
    {
        "content": "Inclusion of PRO data in treatment guidelines [MW, CR, SW] PRO thresholds that should trigger intervention [MW] Incorporation of quality of life considerations in treatment algorithms [CR] \"Treatment guidelines typically focus on survival and response rates. We need to elevate quality of life to equal consideration.\" [SW]\n\nResearch priorities for PRO-clinical outcome correlation [general consensus] Identification of PRO patterns predictive of treatment benefit or harm [SP] Development of composite endpoints incorporating both clinical and patient-reported measures [EC] \"The holy grail is identifying PRO signatures that predict treatment outcomes, allowing for more personalized treatment decisions.\" [SP]\n\nVIII. Expanded Indications Considerations\n\nPotential New Indications\n\nBased on Onculitis' mechanism of action and available preclinical and clinical evidence, advisors identified several promising tumor types for investigation [general consensus] \"The selectivity profile of Onculitis suggests potential activity across several solid tumors beyond Melanocarcinoma.\" [EC]\n\nGastrointestinal stromal tumors (GIST) emerged as a high-priority target [RK, MW, MC] Particularly for patients with resistance to standard tyrosine kinase inhibitors [RK] Preclinical data showing activity in imatinib-resistant models [MW]\n\n\"The biological rationale for Onculitis in TKI-resistant GIST is compelling, and the unmet need is substantial.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 24,
            "chunk_length": 1444,
            "num_words": 187
        }
    },
    {
        "content": "Selected sarcoma subtypes [NB, CR, DR] Soft tissue sarcomas with specific molecular features [NB] Preliminary signals in compassionate use cases [CR] \"The heterogeneity of sarcomas necessitates a biomarker-driven approach, focusing on subtypes with relevant pathway activation.\" [DR]\n\nRefractory thyroid cancers [SP, JT, LJ] Anaplastic and medullary subtypes with limited treatment options [SP] Potential for combination approaches with existing therapies [JT] \"Thyroid cancers represent a modest market but significant unmet need, particularly in aggressive subtypes.\" [LJ]\n\nHematologic malignancies with solid tumor manifestations [TL, SW] Certain lymphomas with predominantly nodal disease [TL] Multiple myeloma with extramedullary disease [SW] \"The unique mechanism of Onculitis might address the solid component of these typically hematologic malignancies, which often respond poorly to standard approaches.\" [TL]\n\nPrioritization framework for indication expansion [EC, MC, RK] Biological rationale based on mechanism of action [EC] Unmet medical need and competitive landscape [MC] Feasibility of clinical development pathway [RK] \"We need a systematic approach to prioritization that balances scientific rationale, medical need, and practical development considerations.\" [EC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 25,
            "chunk_length": 1283,
            "num_words": 166
        }
    },
    {
        "content": "Biomarker strategy for indication expansion [general consensus] Development of a companion diagnostic strategy across tumor types [SP] Tissue-agnostic approach based on molecular features rather than tumor origin [NB] \"A biomarker-driven strategy could accelerate development and increase probability of success across multiple indications.\" [SP]\n\nRegulatory Pathway Strategies\n\nAdvisors discussed various regulatory approaches for expanded indications [general consensus] Traditional phase 1-3 development program versus accelerated pathways [EC] Tissue-agnostic versus tumor-specific approaches [MC]\n\n\"The regulatory strategy should be tailored to each indication based on unmet need, available data, and competitive considerations.\" [EC]\n\nBasket trial design was strongly endorsed for initial signal finding [RK, DR, SP] Multiple tumor types with relevant biomarker profile [RK] Two-stage design with expansion in promising cohorts [DR] \"A well-designed basket trial could efficiently screen multiple tumor types and identify the most promising for further development.\" [SP]\n\nLeveraging real-world evidence to support regulatory submissions [TL, CR, LJ] Real-world data as supportive evidence for formal trials [TL] Potential for RWE to support label expansions in rare tumors [CR] \"The regulatory landscape is evolving, with increasing openness to well-designed RWE studies as supportive or even primary evidence in some contexts.\" [LJ]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 26,
            "chunk_length": 1441,
            "num_words": 189
        }
    },
    {
        "content": "Breakthrough therapy designation strategy [MW, NB, SW] Focus on indications with limited treatment options [MW] Early engagement with regulatory authorities [NB] \"For truly refractory populations, breakthrough designation could substantially accelerate development timelines.\" [SW]\n\nInternational regulatory considerations [SP, JT, DR] Regional differences in evidence requirements [SP] Strategy for global versus regional development [JT] \"A coherent global regulatory strategy is essential, recognizing the different requirements and priorities across major markets.\" [DR]\n\nPediatric investigation considerations [RK, NB, EC] Required pediatric studies for relevant indications [RK] Ethical and practical challenges in pediatric development [NB] \"Pediatric development should be considered early, particularly for tumor types that affect children and young adults.\" [EC]\n\nReimbursement and Access Implications\n\nPayer evidence requirements beyond regulatory approval [general consensus] Comparative effectiveness versus standard of care [SW] Cost-effectiveness and budget impact [LJ]\n\n\"Regulatory approval is just the first hurdle. Payer requirements often exceed regulatory standards, particularly for comparative effectiveness.\" [SW]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 27,
            "chunk_length": 1236,
            "num_words": 149
        }
    },
    {
        "content": "Indication-specific pricing considerations [EC, TL, CR] Challenges with differential pricing across indications [EC] Value-based agreements tied to outcomes in specific indications [TL] \"The one-price-fits-all model creates challenges when a therapy has different value propositions across multiple indications.\" [CR]\n\nReal-world evidence to support reimbursement [MW, DR, MC] Post-approval studies demonstrating value in routine clinical practice [MW] Comparative effectiveness research using real-world data [DR] \"Well-designed RWE studies can address payer concerns about generalizability of clinical trial results to their covered populations.\" [MC]\n\nPatient assistance and access programs [JT, NB, SW] Need for robust support programs, particularly for off-label use [JT] Navigation support for complex reimbursement landscapes [NB] \"Even with favorable coverage decisions, patients often face substantial financial toxicity that requires mitigation through assistance programs.\" [SW]\n\nGlobal reimbursement landscape [SP, RK, LJ] Variation in health technology assessment approaches across markets [SP] Prioritization of markets based on reimbursement feasibility [RK] \"The global payer landscape is heterogeneous, requiring tailored evidence generation and value demonstration strategies for each major market.\" [LJ]\n\nIX. Workshop: Real-World Evidence Implementation\n\nCase Scenario 1: Community-Based Oncology Setting",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 28,
            "chunk_length": 1423,
            "num_words": 176
        }
    },
    {
        "content": "Patient case: 72-year-old male with relapsed Melanocarcinoma, multiple comorbidities (hypertension, type 2 diabetes, mild renal impairment), treated at a community oncology practice with limited research infrastructure\n\nClinical Considerations RWE collection in community settings requires minimizing burden on clinical staff [general consensus]\n\n\"The RWE approach must recognize the resource constraints in community practice. Excessive documentation requirements will result in poor compliance.\" [TL]\n\nPractical strategies for community-based data collection [TL, DR, LJ] Focus on core data elements only [TL] Integration with existing EHR workflows where possible [DR] Consideration of remote data abstraction to reduce site burden [LJ] \"Automation is key—manual data entry is unsustainable in busy community practices with limited support staff.\" [TL]\n\nTechnology solutions for community practices [MC, SW, CR] Mobile applications for patient-reported outcomes [MC] Cloud-based platforms with offline capabilities for areas with connectivity issues [SW] Support for batch data uploads rather than real-time entry [CR] \"Technology solutions must account for the varied IT capabilities across community settings, with fallback options when optimal connectivity isn't available.\" [MC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 29,
            "chunk_length": 1285,
            "num_words": 167
        }
    },
    {
        "content": "Financial considerations for community participation [NB, MW, TL] Fair compensation for data collection efforts [NB] Potential for quality improvement incentives tied to participation [MW] \"Without appropriate financial support, community practices operating on thin margins cannot justify dedicating resources to data collection.\" [TL]\n\nSpecial considerations for elderly patients [DR, SP, JT] Modified PRO collection approaches for patients with limited technology access [DR] Enhanced toxicity monitoring for patients with comorbidities [SP] Caregiver engagement in the reporting process [JT] \"Elderly patients present unique challenges for data collection but represent a critical population for understanding real-world outcomes.\" [DR]\n\nCase Scenario 2: Academic Medical Center Setting\n\nPatient case: 45-year-old female with refractory GIST (off-label Onculitis use), enrolled in a precision oncology program at an academic medical center with robust research infrastructure\n\nClinical Considerations Comprehensive data collection opportunities in academic settings [general consensus]\n\n\"Academic centers can collect richer datasets, including biospecimens and advanced imaging, but still face challenges with sustainable implementation.\" [EC]",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 30,
            "chunk_length": 1247,
            "num_words": 156
        }
    },
    {
        "content": "Integration with existing research infrastructure [MW, RK, MC] Alignment with institutional biobanking protocols [MW] Coordination with ongoing investigator-initiated studies [RK] Leveraging existing data science capabilities [MC] \"Most academic centers have established research infrastructures. The challenge is integration rather than creation.\" [MW]\n\nTranslational research opportunities [SP, NB, CR] Correlative studies using biospecimens from treated patients [SP] Investigation of mechanisms of response and resistance [NB] \"The real value of academic participation is the opportunity for deep mechanistic studies that inform future development.\" [CR]\n\nEthical and regulatory considerations for off-label use data [JT, LJ, SW] IRB requirements for systematic data collection [JT] Informed consent considerations [LJ] Distinction between clinical care documentation and research [SW] \"We must carefully navigate the regulatory boundaries between quality improvement initiatives and formal research when collecting off-label use data.\" [JT]\n\nData sharing and multi-institutional collaboration [EC, RK, SP] Standardized data elements across participating academic centers [EC] Data use agreements and publication policies [RK] Approaches to harmonize biomarker testing across institutions [SP] \"Academic collaboration requires clear governance structures and incentives for participation beyond the scientific merit.\" [EC]\n\nX. Follow-up and Recommendations",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 31,
            "chunk_length": 1460,
            "num_words": 181
        }
    },
    {
        "content": "| ADVISOR FEEDBACK | FOLLOW-UP ACTION |\n|---|---|\n| Real-World Data Collection Framework |  |\n| - Establish a tiered RWD collection approach with core\nelements required from all sites and expanded data from sites\nwith greater capacity | - Develop detailed data dictionary with core\nand supplemental elements (Medical Affairs\nteam, Q2 2025) |\n| - Develop cloud-based platform with EHR integration\ncapabilities that addresses interoperability challenges | - Evaluate technology vendors and initiate\nsystem development (Digital Health team, Q3\n2025) |\n| - Ensure representation of diverse patient populations,\nincluding those typically excluded from clinical trials | - Develop site selection strategy with\ndemographic considerations (HEOR team, Q2\n2025) |\n| - Focus on long-term outcomes extending beyond conventional\nclinical trial endpoints | - Design 5-year minimum follow-up protocol\n(Medical Affairs team, Q2 2025) |\n| Long-Term Safety Monitoring Strategies |  |\n| - Establish comprehensive pharmacovigilance plan with\nenhanced monitoring for specific adverse events of interest | - Convene pharmacovigilance working group\nto develop detailed monitoring plan (Safety\nteam, Q2 2025) |\n| - Create independent safety review committee to periodically\nassess emerging signals | - Draft charter and identify potential\ncommittee members (Medical Affairs team,\nQ3 2025) |\n| - Develop provider education on recognition and management\nof Onculitis-specific adverse events | - Create case-based educational",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_sub_chunk_from_table",
            "chunk_index": 32,
            "chunk_length": 1498,
            "num_words": 220,
            "original_page_num_of_element": 23,
            "original_element_type": "table"
        }
    },
    {
        "content": "ntify potential\ncommittee members (Medical Affairs team,\nQ3 2025) |\n| - Develop provider education on recognition and management\nof Onculitis-specific adverse events | - Create case-based educational modules for\nHCPs (Medical Education team, Q3 2025) |\n| - Implement digital tools for adverse event reporting integrated\ninto clinical workflow | - Evaluate technology solutions for integrated\nAE reporting (Digital Health team, Q3 2025) |\n| Patient-Reported Outcomes Implementation |  |\n| - Select core PRO instruments supplemented by Onculitis-\nspecific symptom assessments | - Finalize PRO battery and assessment\nschedule (HEOR team, Q2 2025) |\n| - Implement multi-modal collection approaches (digital\npreferred, with alternatives for those with limited technology\naccess) | - Develop technology strategy with\naccessibility considerations (Digital Health\nteam, Q3 2025) |\n| - Establish clinically meaningful thresholds and intervention\nalgorithms based on PRO signals | - Convene clinical expert panel to develop\nintervention thresholds (Medical Affairs team,\nQ4 2025) |\n| - Investigate correlation between PRO trends and clinical\noutcomes | - Design analysis plan for PRO-clinical\noutcome correlation (HEOR team, Q3 2025) |\n| Expanded Indications Strategy |  |",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_sub_chunk_from_table",
            "chunk_index": 33,
            "chunk_length": 1262,
            "num_words": 185,
            "original_page_num_of_element": 23,
            "original_element_type": "table"
        }
    },
    {
        "content": "| ADVISOR FEEDBACK | FOLLOW-UP ACTION |\n|---|---|\n| - Prioritize GIST, selected sarcoma subtypes, refractory thyroid\ncancers, and hematologic malignancies with solid tumor\nmanifestations for further investigation | - Develop indication-specific clinical\ndevelopment plans (Clinical Development\nteam, Q3 2025) |\n| - Implement basket trial design with biomarker-driven patient\nselection | - Design master protocol for multi-tumor\ninvestigation (Clinical Development team, Q3\n2025) |\n| - Leverage RWE as supportive evidence for regulatory\nsubmissions | - Develop regulatory strategy incorporating\nRWE components (Regulatory Affairs team,\nQ2 2025) |\n| - Engage payers early regarding evidence requirements for\nreimbursement | - Convene payer advisory board to discuss\nevidence needs (Market Access team, Q3\n2025) |",
        "metadata": {
            "file_name": "Onculitis Real-World Evidence and Long-Term Safety Monitoring Advisory Board.pdf",
            "file_type": "pdf",
            "file_size": 819560,
            "chunk_type": "pdf_chunk",
            "chunk_index": 34,
            "chunk_length": 810,
            "num_words": 115
        }
    }
]